[
  {
    "id": 0,
    "q": "A company is planning to run a global marketing application in the AWS Cloud. The application will feature videos that can be viewed by users. The company must ensure that all users can view these videos with low latency. Which AWS service should the company use to meet this requirement?",
    "a1": "A. AWS Auto Scaling",
    "a2": "B. Amazon Kinesis Video Streams",
    "a3": "C. Elastic Load Balancing",
    "a4": "D. Amazon CloudFront",
    "a5": "",
    "as": "D"
  },
  {
    "id": 1,
    "q": "Which pillar of the AWS Well-Architected Framework refers to the ability of a system to recover from infrastructure or service disruptions and dynamically acquire computing resources to meet demand?",
    "a1": "A. Security",
    "a2": "B. Reliability",
    "a3": "C. Performance efficiency",
    "a4": "D. Cost optimization",
    "a5": "",
    "as": "B"
  },
  {
    "id": 2,
    "q": "Which of the following are benefits of migrating to the AWS Cloud? (Choose two.)",
    "a1": "A. Operational resilience",
    "a2": "B. Discounts for products on Amazon.com",
    "a3": "C. Business agility",
    "a4": "D. Business excellence",
    "a5": "E. Increased staff retention",
    "as": "AC"
  },
  {
    "id": 3,
    "q": "A company is planning to replace its physical on-premises compute servers with AWS serverless compute services. The company wants to be able to take advantage of advanced technologies quickly after the migration. Which pillar of the AWS Well-Architected Framework does this plan represent?",
    "a1": "A. Security",
    "a2": "B. Performance efficiency",
    "a3": "C. Operational excellence",
    "a4": "D. Reliability",
    "a5": "",
    "as": "B"
  },
  {
    "id": 4,
    "q": "A large company has multiple departments. Each department has its own AWS account. Each department has purchased Amazon EC2 Reserved Instances. Some departments do not use all the Reserved Instances that they purchased, and other departments need more Reserved Instances than they purchased. The company needs to manage the AWS accounts for all the departments so that the departments can share the Reserved Instances. Which AWS service or tool should the company use to meet these requirements?",
    "a1": "A. AWS Systems Manager",
    "a2": "B. Cost Explorer",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Organizations",
    "a5": "",
    "as": "D"
  },
  {
    "id": 5,
    "q": "Which component of the AWS global infrastructure is made up of one or more discrete data centers that have redundant power, networking, and connectivity?",
    "a1": "A. AWS Region",
    "a2": "B. Availability Zone",
    "a3": "C. Edge location",
    "a4": "D. AWS Outposts",
    "a5": "",
    "as": "B"
  },
  {
    "id": 6,
    "q": "Which duties are the responsibility of a company that is using AWS Lambda? (Choose two.)",
    "a1": "A. Security inside of code ",
    "a2": "B. Selection of CPU resources",
    "a3": "C. Patching of operating system",
    "a4": "D. Writing and updating of code",
    "a5": "E. Security of underlying infrastructure",
    "as": "AD"
  },
  {
    "id": 7,
    "q": "Which AWS services or features provide disaster recovery solutions for Amazon EC2 instances? (Choose two.)",
    "a1": "A. EC2 Reserved Instances",
    "a2": "B. EC2 Amazon Machine Images (AMIs)",
    "a3": "C. Amazon Elastic Block Store (Amazon EBS) snapshots",
    "a4": "D. AWS Shield",
    "a5": "E. Amazon GuardDuty",
    "as": "BC"
  },
  {
    "id": 8,
    "q": "A company is migrating to the AWS Cloud instead of running its infrastructure on premises. Which of the following are advantages of this migration? (Choose two.)",
    "a1": "A. Elimination of the need to perform security auditing",
    "a2": "B. Increased global reach and agility",
    "a3": "C. Ability to deploy globally in minutes",
    "a4": "D. Elimination of the cost of IT staff members",
    "a5": "E. Redundancy by default for all compute services",
    "as": "BC"
  },
  {
    "id": 9,
    "q": "A user is comparing purchase options for an application that runs on Amazon EC2 and Amazon RDS. The application cannot sustain any interruption. The application experiences a predictable amount of usage, including some seasonal spikes that last only a few weeks at a time. It is not possible to modify the application. Which purchase option meets these requirements MOST cost-effectively?",
    "a1": "A. Review the AWS Marketplace and buy Partial Upfront Reserved Instances to cover the predicted and seasonal load.",
    "a2": "B. Buy Reserved Instances for the predicted amount of usage throughout the year. Allow any seasonal usage to run on Spot Instances.",
    "a3": "C. Buy Reserved Instances for the predicted amount of usage throughout the year. Allow any seasonal usage to run at an On-Demand rate.",
    "a4": "D. Buy Reserved Instances to cover all potential usage that results from the seasonal usage.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 10,
    "q": "A company wants to review its monthly costs of using Amazon EC2 and Amazon RDS for the past year. Which AWS service or tool provides this information?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. Cost Explorer",
    "a3": "C. Amazon Forecast",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "B"
  },
  {
    "id": 11,
    "q": "A company wants to migrate a critical application to AWS. The application has a short runtime. The application is invoked by changes in data or by shifts in system state. The company needs a compute solution that maximizes operational efficiency and minimizes the cost of running the application. Which AWS solution should the company use to meet these requirements?",
    "a1": "A. Amazon EC2 On-Demand Instances",
    "a2": "B. AWS Lambda",
    "a3": "C. Amazon EC2 Reserved Instances",
    "a4": "D. Amazon EC2 Spot Instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 12,
    "q": "Which AWS service or feature allows users to connect with and deploy AWS services programmatically?",
    "a1": "A. AWS Management Console",
    "a2": "B. AWS Cloud9",
    "a3": "C. AWS CodePipeline",
    "a4": "D. AWS software development kits (SDKs)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 13,
    "q": "A company plans to create a data lake that uses Amazon S3. Which factor will have the MOST effect on cost?",
    "a1": "A. The selection of S3 storage tiers",
    "a2": "B. Charges to transfer existing data into Amazon S3",
    "a3": "C. The addition of S3 bucket policies",
    "a4": "D. S3 ingest fees for each request",
    "a5": "",
    "as": "A"
  },
  {
    "id": 14,
    "q": "A company is launching an ecommerce application that must always be available. The application will run on Amazon EC2 instances continuously for the next 12 months. What is the MOST cost-effective instance purchasing option that meets these requirements?",
    "a1": "A. Spot Instances",
    "a2": "B. Savings Plans",
    "a3": "C. Dedicated Hosts",
    "a4": "D. On-Demand Instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 15,
    "q": "Which AWS service or feature can a company use to determine which business unit is using specific AWS resources?",
    "a1": "A. Cost allocation tags",
    "a2": "B. Key pairs",
    "a3": "C. Amazon Inspector",
    "a4": "D. AWS Trusted Advisor",
    "a5": "",
    "as": "A"
  },
  {
    "id": 16,
    "q": "A company wants to migrate its workloads to AWS, but it lacks expertise in AWS Cloud computing. Which AWS service or feature will help the company with its migration?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. AWS Consulting Partners",
    "a3": "C. AWS Artifacts",
    "a4": "D. AWS Managed Services",
    "a5": "",
    "as": "B"
  },
  {
    "id": 17,
    "q": "Which AWS service or tool should a company use to centrally request and track service limit increases?",
    "a1": "A. AWS Config",
    "a2": "B. Service Quotas",
    "a3": "C. AWS Service Catalog",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "B"
  },
  {
    "id": 18,
    "q": "Which documentation does AWS Artifact provide?",
    "a1": "A. Amazon EC2 terms and conditions",
    "a2": "B. AWS ISO certifications",
    "a3": "C. A history of a company's AWS spending",
    "a4": "D. A list of previous-generation Amazon EC2 instance types",
    "a5": "",
    "as": "B"
  },
  {
    "id": 19,
    "q": "Which task requires using AWS account root user credentials?",
    "a1": "A. Viewing billing information",
    "a2": "B. Changing the AWS Support plan",
    "a3": "C. Starting and stopping Amazon EC2 instances",
    "a4": "D. Opening an AWS Support case",
    "a5": "",
    "as": "B"
  },
  {
    "id": 20,
    "q": "A company needs to simultaneously process hundreds of requests from different users. Which combination of AWS services should the company use to build an operationally efficient solution?",
    "a1": "A. Amazon Simple Queue Service (Amazon SQS) and AWS Lambda",
    "a2": "B. AWS Data Pipeline and Amazon EC2",
    "a3": "C. Amazon Kinesis and Amazon Athena",
    "a4": "D. AWS Amplify and AWS AppSync",
    "a5": "",
    "as": "A"
  },
  {
    "id": 21,
    "q": "What is the scope of a VPC within the AWS network?",
    "a1": "A. A VPC can span all Availability Zones globally.",
    "a2": "B. A VPC must span at least two subnets in each AWS Region.",
    "a3": "C. A VPC must span at least two edge locations in each AWS Region.",
    "a4": "D. A VPC can span all Availability Zones within an AWS Region.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 22,
    "q": "Which of the following are components of an AWS Site-to-Site VPN connection? (Choose two.)",
    "a1": "A. AWS Storage Gateway",
    "a2": "B. Virtual private gateway",
    "a3": "C. NAT gateway",
    "a4": "D. Customer gateway",
    "a5": "E. Internet gateway",
    "as": "BD"
  },
  {
    "id": 23,
    "q": "A company needs to establish a connection between two VPCs. The VPCs are located in two different AWS Regions. The company wants to use the existing infrastructure of the VPCs for this connection. Which AWS service or feature can be used to establish this connection?",
    "a1": "A. AWS Client VPN",
    "a2": "B. VPC peering",
    "a3": "C. AWS Direct Connect",
    "a4": "D. VPC endpoints",
    "a5": "",
    "as": "B"
  },
  {
    "id": 24,
    "q": "According to the AWS shared responsibility model, what responsibility does a customer have when using Amazon RDS to host a database?",
    "a1": "A. Manage connections to the database",
    "a2": "B. Install Microsoft SQL Server",
    "a3": "C. Design encryption-at-rest strategies",
    "a4": "D. Apply minor database patches",
    "a5": "",
    "as": "A"
  },
  {
    "id": 25,
    "q": "What are some advantages of using Amazon EC2 instances to host applications in the AWS Cloud instead of on premises? (Choose two.)",
    "a1": "A. EC2 includes operating system patch management.",
    "a2": "B. EC2 integrates with Amazon VPC, AWS CloudTrail, and AWS Identity and Access Management (IAM).",
    "a3": "C. EC2 has a 100% service level agreement (SLA).",
    "a4": "D. EC2 has a flexible, pay-as-you-go pricing model.",
    "a5": "E. EC2 has automatic storage cost optimization.",
    "as": "BD"
  },
  {
    "id": 26,
    "q": "A user needs to determine whether an Amazon EC2 instance's security groups were modified in the last month. How can the user see if a change was made?",
    "a1": "A. Use Amazon EC2 to see if the security group was changed.",
    "a2": "B. Use AWS Identity and Access Management (IAM) to see which user or role changed the security group.",
    "a3": "C. Use AWS CloudTrail to see if the security group was changed.",
    "a4": "D. Use Amazon CloudWatch to see if the security group was changed.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 27,
    "q": "Which AWS service will help protect applications running on AWS from DDoS attacks?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS WAF",
    "a3": "C. AWS Shield",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "C"
  },
  {
    "id": 28,
    "q": "Which AWS service or feature acts as a firewall for Amazon EC2 instances?",
    "a1": "A. Network ACL",
    "a2": "B. Elastic network interface",
    "a3": "C. Amazon VPC",
    "a4": "D. Security group",
    "a5": "",
    "as": "D"
  },
  {
    "id": 29,
    "q": "How does the AWS Cloud pricing model differ from the traditional on-premises storage pricing model?",
    "a1": "A. AWS resources do not incur costs",
    "a2": "B. There are no infrastructure operating costs",
    "a3": "C. There are no upfront cost commitments",
    "a4": "D. There are no software licensing costs",
    "a5": "",
    "as": "C"
  },
  {
    "id": 30,
    "q": "A company has a single Amazon EC2 instance. The company wants to adopt a highly available architecture. What can the company do to meet this requirement?",
    "a1": "A. Scale vertically to a larger EC2 instance size.",
    "a2": "B. Scale horizontally across multiple Availability Zones.",
    "a3": "C. Purchase an EC2 Dedicated Instance.",
    "a4": "D. Change the EC2 instance family to a compute optimized instance.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 31,
    "q": "A company's on-premises application deployment cycle was 3-4 weeks. After migrating to the AWS Cloud, the company can deploy the application in 2-3 days. Which benefit has this company experienced by moving to the AWS Cloud?",
    "a1": "A. Elasticity",
    "a2": "B. Flexibility",
    "a3": "C. Agility",
    "a4": "D. Resilience",
    "a5": "",
    "as": "C"
  },
  {
    "id": 32,
    "q": "Which of the following are included in AWS Enterprise Support? (Choose two.)",
    "a1": "A. AWS technical account manager (TAM)",
    "a2": "B. AWS partner-led support",
    "a3": "C. AWS Professional Services",
    "a4": "D. Support of third-party software integration to AWS",
    "a5": "E. 5-minute response time for critical issues",
    "as": "AD"
  },
  {
    "id": 33,
    "q": "A global media company uses AWS Organizations to manage multiple AWS accounts. Which AWS service or feature can the company use to limit the access to AWS services for member accounts?",
    "a1": "A. AWS Identity and Access Management (IAM)",
    "a2": "B. Service control policies (SCPs)",
    "a3": "C. Organizational units (OUs)",
    "a4": "D. Access control lists (ACLs)",
    "a5": "",
    "as": "B"
  },
  {
    "id": 34,
    "q": "A company wants to limit its employees' AWS access to a portfolio of predefined AWS resources. Which AWS solution should the company use to meet this requirement?",
    "a1": "A. AWS Config",
    "a2": "B. AWS software development kits (SDKs)",
    "a3": "C. AWS Service Catalog",
    "a4": "D. AWS AppSync",
    "a5": "",
    "as": "C"
  },
  {
    "id": 35,
    "q": "An online company was running a workload on premises and was struggling to launch new products and features. After migrating the workload to AWS, the company can quickly launch products and features and can scale its infrastructure as required. Which AWS Cloud value proposition does this scenario describe?",
    "a1": "A. Business agility",
    "a2": "B. High availability",
    "a3": "C. Security",
    "a4": "D. Centralized auditing",
    "a5": "",
    "as": "A"
  },
  {
    "id": 36,
    "q": "Which of the following are advantages of the AWS Cloud? (Choose two.)",
    "a1": "A. AWS management of user-owned infrastructure",
    "a2": "B. Ability to quickly change required capacity",
    "a3": "C. High economies of scale",
    "a4": "D. Increased deployment time to market",
    "a5": "E. Increased fixed expenses",
    "as": "BC"
  },
  {
    "id": 37,
    "q": "AWS has the ability to achieve lower pay-as-you-go pricing by aggregating usage across hundreds of thousands of users. This describes which advantage of the AWS Cloud?",
    "a1": "A. Launch globally in minutes",
    "a2": "B. Increase speed and agility",
    "a3": "C. High economies of scale",
    "a4": "D. No guessing about compute capacity",
    "a5": "",
    "as": "C"
  },
  {
    "id": 38,
    "q": "A company has a database server that is always running. The company hosts the server on Amazon EC2 instances. The instance sizes are suitable for the workload. The workload will run for 1 year. Which EC2 instance purchasing option will meet these requirements MOST cost-effectively?",
    "a1": "A. Standard Reserved Instances",
    "a2": "B. On-Demand Instances",
    "a3": "C. Spot Instances",
    "a4": "D. Convertible Reserved Instances",
    "a5": "",
    "as": "A"
  },
  {
    "id": 39,
    "q": "A company is developing a mobile app that needs a high-performance NoSQL database. Which AWS services could the company use for this database? (Choose two.)",
    "a1": "A. Amazon Aurora",
    "a2": "B. Amazon RDS",
    "a3": "C. Amazon Redshift",
    "a4": "D. Amazon DocumentDB (with MongoDB compatibility)",
    "a5": "E. Amazon DynamoDB",
    "as": "DE"
  },
  {
    "id": 40,
    "q": "Which tasks are the responsibility of AWS, according to the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Patch the Amazon EC2 guest operating system.",
    "a2": "B. Upgrade the firmware of the network infrastructure.",
    "a3": "C. Apply password rotation for IAM users.",
    "a4": "D. Maintain the physical security of edge locations.",
    "a5": "E. Maintain least privilege access to the root user account.",
    "as": "BD"
  },
  {
    "id": 41,
    "q": "Which of the following are features of network ACLs as they are used in the AWS Cloud? (Choose two.)",
    "a1": "A. They are stateless.",
    "a2": "B. They are stateful.",
    "a3": "C. They evaluate all rules before allowing traffic.",
    "a4": "D. They process rules in order, starting with the lowest numbered rule, when deciding whether to allow traffic.",
    "a5": "E. They operate at the instance level.",
    "as": "AD"
  },
  {
    "id": 42,
    "q": "A company has designed its AWS Cloud infrastructure to run its workloads effectively. The company also has protocols in place to continuously improve supporting processes. Which pillar of the AWS Well-Architected Framework does this scenario represent?",
    "a1": "A. Security",
    "a2": "B. Performance efficiency",
    "a3": "C. Cost optimization",
    "a4": "D. Operational excellence",
    "a5": "",
    "as": "D"
  },
  {
    "id": 43,
    "q": "Which AWS service or feature can be used to create a private connection between an on-premises workload and an AWS Cloud workload?",
    "a1": "A. Amazon Route 53",
    "a2": "B. Amazon Macie",
    "a3": "C. AWS Direct Connect",
    "a4": "D. AWS PrivateLink",
    "a5": "",
    "as": "C"
  },
  {
    "id": 44,
    "q": "A company needs to graphically visualize AWS billing and usage over time. The company also needs information about its AWS monthly costs. Which AWS Billing and Cost Management tool provides this data in a graphical format?",
    "a1": "A. AWS Bills",
    "a2": "B. Cost Explorer",
    "a3": "C. AWS Cost and Usage Report",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "B"
  },
  {
    "id": 45,
    "q": "A company wants to run production workloads on AWS. The company needs concierge service, a designated AWS technical account manager (TAM), and technical support that is available 24 hours a day, 7 days a week. Which AWS Support plan will meet these requirements?",
    "a1": "A. AWS Basic Support",
    "a2": "B. AWS Enterprise Support",
    "a3": "C. AWS Business Support",
    "a4": "D. AWS Developer Support",
    "a5": "",
    "as": "B"
  },
  {
    "id": 46,
    "q": "Which architecture design principle describes the need to isolate failures between dependent components in the AWS Cloud?",
    "a1": "A. Use a monolithic design.",
    "a2": "B. Design for automation.",
    "a3": "C. Design for single points of failure.",
    "a4": "D. Loosely couple components.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 47,
    "q": "Which AWS services are managed database services? (Choose two.)",
    "a1": "A. Amazon Elastic Block Store (Amazon EBS)",
    "a2": "B. Amazon S3",
    "a3": "C. Amazon RDS",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "E. Amazon DynamoDB",
    "as": "CE"
  },
  {
    "id": 48,
    "q": "A company is using the AWS Free Tier for several AWS services for an application. What will happen if the Free Tier usage period expires or if the application use exceeds the Free Tier usage limits?",
    "a1": "A. The company will be charged the standard pay-as-you-go service rates for the usage that exceeds the Free Tier usage.",
    "a2": "B. AWS Support will contact the company to set up standard service charges.",
    "a3": "C. The company will be charged for the services it consumed during the Free Tier period, plus additional charges for service consumption after the Free Tier period.",
    "a4": "D. The company's AWS account will be frozen and can be restarted after a payment plan is established.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 49,
    "q": "A company recently deployed an Amazon RDS instance in its VPC. The company needs to implement a stateful firewall to limit traffic to the private corporate network. Which AWS service or feature should the company use to limit network traffic directly to its RDS instance?",
    "a1": "A. Network ACLs",
    "a2": "B. Security groups",
    "a3": "C. AWS WAF",
    "a4": "D. Amazon GuardDuty",
    "a5": "",
    "as": "B"
  },
  {
    "id": 50,
    "q": "Which AWS service uses machine learning to help discover, monitor, and protect sensitive data that is stored in Amazon S3 buckets?",
    "a1": "A. AWS Shield",
    "a2": "B. Amazon Macie",
    "a3": "C. AWS Network Firewall",
    "a4": "D. Amazon Cognito",
    "a5": "",
    "as": "B"
  },
  {
    "id": 51,
    "q": "A company wants to improve the overall availability and performance of its applications that are hosted on AWS. Which AWS service should the company use?",
    "a1": "A. Amazon Connect",
    "a2": "B. Amazon Lightsail",
    "a3": "C. AWS Global Accelerator",
    "a4": "D. AWS Storage Gateway",
    "a5": "",
    "as": "C"
  },
  {
    "id": 52,
    "q": "Which AWS service or feature identifies whether an Amazon S3 bucket or an IAM role has been shared with an external entity?",
    "a1": "A. AWS Service Catalog",
    "a2": "B. AWS Systems Manager",
    "a3": "C. AWS IAM Access Analyzer",
    "a4": "D. AWS Organizations",
    "a5": "",
    "as": "C"
  },
  {
    "id": 53,
    "q": "A company does not want to rely on elaborate forecasting to determine its usage of compute resources. Instead, the company wants to pay only for the resources that it uses. The company also needs the ability to increase or decrease its resource usage to meet business requirements. Which pillar of the AWS Well-Architected Framework aligns with these requirements?",
    "a1": "A. Operational excellence",
    "a2": "B. Security",
    "a3": "C. Reliability",
    "a4": "D. Cost optimization",
    "a5": "",
    "as": "D"
  },
  {
    "id": 54,
    "q": "A company wants to launch its workload on AWS and requires the system to automatically recover from failure. Which pillar of the AWS Well-Architected Framework includes this requirement?",
    "a1": "A. Cost optimization",
    "a2": "B. Operational excellence",
    "a3": "C. Performance efficiency",
    "a4": "D. Reliability",
    "a5": "",
    "as": "D"
  },
  {
    "id": 55,
    "q": "A large enterprise with multiple VPCs in several AWS Regions around the world needs to connect and centrally manage network connectivity between its VPCs. Which AWS service or feature meets these requirements?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. AWS Transit Gateway",
    "a3": "C. AWS Site-to-Site VPN",
    "a4": "D. VPC endpoints",
    "a5": "",
    "as": "B"
  },
  {
    "id": 56,
    "q": "Which AWS service supports the creation of visual reports from AWS Cost and Usage Report data?",
    "a1": "A. Amazon Athena",
    "a2": "B. Amazon QuickSight",
    "a3": "C. Amazon CloudWatch",
    "a4": "D. AWS Organizations",
    "a5": "",
    "as": "B"
  },
  {
    "id": 57,
    "q": "Which AWS service should be used to monitor Amazon EC2 instances for CPU and network utilization?",
    "a1": "A. Amazon Inspector",
    "a2": "B. AWS CloudTrail",
    "a3": "C. Amazon CloudWatch",
    "a4": "D. AWS Config",
    "a5": "",
    "as": "C"
  },
  {
    "id": 58,
    "q": "A company is preparing to launch a new web store that is expected to receive high traffic for an upcoming event. The web store runs only on AWS, and the company has an AWS Enterprise Support plan. Which AWS resource will provide guidance about how the company should scale its architecture and operational support during the event?",
    "a1": "A. AWS Abuse team",
    "a2": "B. The designated AWS technical account manager (TAM)",
    "a3": "C. AWS infrastructure event management",
    "a4": "D. AWS Professional Services",
    "a5": "",
    "as": "C"
  },
  {
    "id": 59,
    "q": "A user wants to deploy a service to the AWS Cloud by using infrastructure-as-code (IaC) principles. Which AWS service can be used to meet this requirement?",
    "a1": "A. AWS Systems Manager",
    "a2": "B. AWS CloudFormation",
    "a3": "C. AWS CodeCommit",
    "a4": "D. AWS Config",
    "a5": "",
    "as": "B"
  },
  {
    "id": 60,
    "q": "A company that has multiple business units wants to centrally manage and govern its AWS Cloud environments. The company wants to automate the creation of AWS accounts, apply service control policies (SCPs), and simplify billing processes. Which AWS service or tool should the company use to meet these requirements?",
    "a1": "A. AWS Organizations",
    "a2": "B. Cost Explorer",
    "a3": "C. AWS Budgets",
    "a4": "D. AWS Trusted Advisor",
    "a5": "",
    "as": "A"
  },
  {
    "id": 61,
    "q": "Which IT controls do AWS and the customer share, according to the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Physical and environmental controls",
    "a2": "B. Patch management",
    "a3": "C. Cloud awareness and training",
    "a4": "D. Zone security",
    "a5": "E. Application data encryption",
    "as": "BC"
  },
  {
    "id": 62,
    "q": "A company is launching an application in the AWS Cloud. The application will use Amazon S3 storage. A large team of researchers will have shared access to the data. The company must be able to recover data that is accidentally overwritten or deleted. Which S3 feature should the company turn on to meet this requirement?",
    "a1": "A. Server access logging",
    "a2": "B. S3 Versioning",
    "a3": "C. S3 Lifecycle rules",
    "a4": "D. Encryption in transit and at rest",
    "a5": "",
    "as": "B"
  },
  {
    "id": 63,
    "q": "A manufacturing company has a critical application that runs at a remote site that has a slow internet connection. The company wants to migrate the workload to AWS. The application is sensitive to latency and interruptions in connectivity. The company wants a solution that can host this application with minimum latency. Which AWS service or feature should the company use to meet these requirements?",
    "a1": "A. Availability Zones",
    "a2": "B. AWS Local Zones",
    "a3": "C. AWS Wavelength",
    "a4": "D. AWS Outposts",
    "a5": "",
    "as": "B"
  },
  {
    "id": 64,
    "q": "A company wants to migrate its applications from its on-premises data center to a VPC in the AWS Cloud. These applications will need to access on-premises resources. Which actions will meet these requirements? (Choose two.)",
    "a1": "A. Use AWS Service Catalog to identify a list of on-premises resources that can be migrated.",
    "a2": "B. Create a VPN connection between an on-premises device and a virtual private gateway in the VPC.",
    "a3": "C. Use an Amazon CloudFront distribution and configure it to accelerate content delivery close to the on-premises resources.",
    "a4": "D. Set up an AWS Direct Connect connection between the on-premises data center and AWS.",
    "a5": "E. Use Amazon CloudFront to restrict access to static web content provided through the on-premises web servers.",
    "as": "BD"
  },
  {
    "id": 65,
    "q": "A company wants to use the AWS Cloud to provide secure access to desktop applications that are running in a fully managed environment. Which AWS service should the company use to meet this requirement?",
    "a1": "A. Amazon S3",
    "a2": "B. Amazon AppStream 2.0",
    "a3": "C. AWS AppSync",
    "a4": "D. AWS Outposts",
    "a5": "",
    "as": "B"
  },
  {
    "id": 66,
    "q": "A company wants to implement threat detection on its AWS infrastructure. However, the company does not want to deploy additional software. Which AWS service should the company use to meet these requirements?",
    "a1": "A. Amazon VPC",
    "a2": "B. Amazon EC2",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. AWS Direct Connect",
    "a5": "",
    "as": "C"
  },
  {
    "id": 67,
    "q": "Which AWS service uses edge locations?",
    "a1": "A. Amazon Aurora",
    "a2": "B. AWS Global Accelerator",
    "a3": "C. Amazon Connect",
    "a4": "D. AWS Outposts",
    "a5": "",
    "as": "B"
  },
  {
    "id": 68,
    "q": "A company needs to install an application in a Docker container. Which AWS service eliminates the need to provision and manage the container hosts?",
    "a1": "A. AWS Fargate",
    "a2": "B. Amazon FSx for Windows File Server",
    "a3": "C. Amazon Elastic Container Service (Amazon ECS)",
    "a4": "D. Amazon EC2",
    "a5": "",
    "as": "A"
  },
  {
    "id": 69,
    "q": "Which AWS service or feature checks access policies and offers actionable recommendations to help users set secure and functional policies?",
    "a1": "A. AWS Systems Manager",
    "a2": "B. AWS IAM Access Analyzer",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. Amazon GuardDuty",
    "a5": "",
    "as": "B"
  },
  {
    "id": 70,
    "q": "A company has a fleet of cargo ships. The cargo ships have sensors that collect data at sea, where there is intermittent or no internet connectivity. The company needs to collect, format, and process the data at sea and move the data to AWS later. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS IoT Core",
    "a2": "B. Amazon Lightsail",
    "a3": "C. AWS Storage Gateway",
    "a4": "D. AWS Snowball Edge",
    "a5": "",
    "as": "D"
  },
  {
    "id": 71,
    "q": "A retail company needs to build a highly available architecture for a new ecommerce platform. The company is using only AWS services that replicate data across multiple Availability Zones. Which AWS services should the company use to meet this requirement? (Choose two.)",
    "a1": "A. Amazon EC2",
    "a2": "B. Amazon Elastic Block Store (Amazon EBS)",
    "a3": "C. Amazon Aurora",
    "a4": "D. Amazon DynamoDB",
    "a5": "E. Amazon Redshift",
    "as": "CD"
  },
  {
    "id": 72,
    "q": "Which characteristic of the AWS Cloud helps users eliminate underutilized CPU capacity?",
    "a1": "A. Agility",
    "a2": "B. Elasticity",
    "a3": "C. Reliability",
    "a4": "D. Durability",
    "a5": "",
    "as": "B"
  },
  {
    "id": 73,
    "q": "Service control policies (SCPs) manage permissions for which of the following?",
    "a1": "A. Availability Zones",
    "a2": "B. AWS Regions",
    "a3": "C. AWS Organizations",
    "a4": "D. Edge locations",
    "a5": "",
    "as": "C"
  },
  {
    "id": 74,
    "q": "Which AWS service can be used to encrypt data at rest?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS Shield",
    "a3": "C. AWS Security Hub",
    "a4": "D. AWS Key Management Service (AWS KMS)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 75,
    "q": "Which characteristics are advantages of using the AWS Cloud? (Choose two.)",
    "a1": "A. A 100% service level agreement (SLA) for all AWS services",
    "a2": "B. Compute capacity that is adjusted on demand",
    "a3": "C. Availability of AWS Support for code development",
    "a4": "D. Enhanced security",
    "a5": "E. Increases in cost and complexity",
    "as": "BD"
  },
  {
    "id": 76,
    "q": "A user is storing objects in Amazon S3. The user needs to restrict access to the objects to meet compliance obligations. What should the user do to meet this requirement?",
    "a1": "A. Use AWS Secrets Manager.",
    "a2": "B. Tag the objects in the S3 bucket.",
    "a3": "C. Use security groups.",
    "a4": "D. Use network ACLs.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 77,
    "q": "A company wants to convert video files and audio files from their source format into a format that will play on smartphones, tablets, and web browsers. Which AWS service will meet these requirements?",
    "a1": "A. Amazon Elastic Transcoder",
    "a2": "B. Amazon Comprehend",
    "a3": "C. AWS Glue",
    "a4": "D. Amazon Rekognition",
    "a5": "",
    "as": "A"
  },
  {
    "id": 78,
    "q": "Which of the following are benefits of Amazon EC2 Auto Scaling? (Choose two.)",
    "a1": "A. Improved health and availability of applications",
    "a2": "B. Reduced network latency",
    "a3": "C. Optimized performance and costs",
    "a4": "D. Automated snapshots of data",
    "a5": "E. Cross-Region Replication",
    "as": "AC"
  },
  {
    "id": 79,
    "q": "A company has several departments. Each department has its own AWS accounts for its applications. The company wants all AWS costs on a single invoice to simplify payment, but the company wants to know the costs that each department is incurring. Which AWS tool or feature will provide this functionality?",
    "a1": "A. AWS Cost and Usage Reports",
    "a2": "B. Consolidated billing",
    "a3": "C. Savings Plans",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "B"
  },
  {
    "id": 80,
    "q": "A company runs its workloads on premises. The company wants to forecast the cost of running a large application on AWS. Which AWS service or tool can the company use to obtain this information?",
    "a1": "A. AWS Pricing Calculator",
    "a2": "B. AWS Budgets",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. Cost Explorer",
    "a5": "",
    "as": "A"
  },
  {
    "id": 81,
    "q": "A company wants to eliminate the need to guess infrastructure capacity before deployments. The company also wants to spend its budget on cloud resources only as the company uses the resources. Which advantage of the AWS Cloud matches the company's requirements?",
    "a1": "A. Reliability",
    "a2": "B. Global reach",
    "a3": "C. Economies of scale",
    "a4": "D. Pay-as-you-go pricing",
    "a5": "",
    "as": "D"
  },
  {
    "id": 82,
    "q": "Which AWS service supports a hybrid architecture that gives users the ability to extend AWS infrastructure, AWS services, APIs, and tools to data centers, co- location environments, or on-premises facilities?",
    "a1": "A. AWS Snowmobile",
    "a2": "B. AWS Local Zones",
    "a3": "C. AWS Outposts",
    "a4": "D. AWS Fargate",
    "a5": "",
    "as": "C"
  },
  {
    "id": 83,
    "q": "A company has a physical tape library to store data backups. The tape library is running out of space. The company needs to extend the tape library's capacity to the AWS Cloud.Which AWS service should the company use to meet this requirement?",
    "a1": "A. Amazon Elastic Block Store (Amazon EBS)",
    "a2": "B. Amazon S3",
    "a3": "C. Amazon Elastic File System (Amazon EFS)",
    "a4": "D. AWS Storage Gateway",
    "a5": "",
    "as": "D"
  },
  {
    "id": 84,
    "q": "An online retail company has seasonal sales spikes several times a year, primarily around holidays. Demand is lower at other times. The company finds it difficult to predict the increasing infrastructure demand for each season. Which advantages of moving to the AWS Cloud would MOST benefit the company? (Choose two.)",
    "a1": "A. Global footprint",
    "a2": "B. Elasticity",
    "a3": "C. AWS service quotas",
    "a4": "D. AWS shared responsibility model",
    "a5": "E. Pay-as-you-go pricing",
    "as": "BE"
  },
  {
    "id": 85,
    "q": "Which AWS service can be used to turn text into lifelike speech?",
    "a1": "A. Amazon Polly",
    "a2": "B. Amazon Kendra",
    "a3": "C. Amazon Rekognition",
    "a4": "D. Amazon Connect",
    "a5": "",
    "as": "A"
  },
  {
    "id": 86,
    "q": "Which AWS service or tool can be used to capture information about inbound and outbound traffic in an Amazon VPC?",
    "a1": "A. VPC Flow Logs",
    "a2": "B. Amazon Inspector",
    "a3": "C. VPC endpoint services",
    "a4": "D. NAT gateway",
    "a5": "",
    "as": "A"
  },
  {
    "id": 87,
    "q": "A company wants to ensure that two Amazon EC2 instances are in separate data centers with minimal communication latency between the data centers. How can the company meet this requirement?",
    "a1": "A. Place the EC2 instances in two separate AWS Regions connected with a VPC peering connection.",
    "a2": "B. Place the EC2 instances in two separate Availability Zones within the same AWS Region.",
    "a3": "C. Place one EC2 instance on premises and the other in an AWS Region. Then connect them by using an AWS VPN connection.",
    "a4": "D. Place both EC2 instances in a placement group for dedicated bandwidth.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 88,
    "q": "In which situations should a company create an IAM user instead of an IAM role? (Choose two.)",
    "a1": "A. When an application that runs on Amazon EC2 instances requires access to other AWS services",
    "a2": "B. When the company creates AWS access credentials for individuals",
    "a3": "C. When the company creates an application that runs on a mobile phone that makes requests to AWS",
    "a4": "D. When the company needs to add users to IAM groups",
    "a5": "E. When users are authenticated in the corporate network and want to be able to use AWS without having to sign in a second time",
    "as": "BD"
  },
  {
    "id": 89,
    "q": "Which AWS services should a company use to read and write data that changes frequently? (Choose two.)",
    "a1": "A. Amazon S3 Glacier",
    "a2": "B. Amazon RDS",
    "a3": "C. AWS Snowball",
    "a4": "D. Amazon Redshift",
    "a5": "E. Amazon Elastic File System (Amazon EFS)",
    "as": "BE"
  },
  {
    "id": 90,
    "q": "Which AWS service is used to provide encryption for Amazon EBS?",
    "a1": "A. AWS Certificate Manager",
    "a2": "B. AWS Systems Manager",
    "a3": "C. AWS KMS",
    "a4": "D. AWS Config",
    "a5": "",
    "as": "C"
  },
  {
    "id": 91,
    "q": "Which AWS services make use of global edge locations? (Choose two.)",
    "a1": "A. AWS Fargate",
    "a2": "B. Amazon CloudFront",
    "a3": "C. AWS Global Accelerator",
    "a4": "D. AWS Wavelength",
    "a5": "E. Amazon VPC",
    "as": "BC"
  },
  {
    "id": 92,
    "q": "A company is operating several factories where it builds products. The company needs the ability to process data, store data, and run applications with local system interdependencies that require low latency. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS IoT Greengrass",
    "a2": "B. AWS Lambda",
    "a3": "C. AWS Outposts",
    "a4": "D. AWS Snowball Edge",
    "a5": "",
    "as": "C"
  },
  {
    "id": 93,
    "q": "Which of the following is a recommended design principle for AWS Cloud architecture?",
    "a1": "A. Design tightly coupled components.",
    "a2": "B. Build a single application component that can handle all the application functionality.",
    "a3": "C. Make large changes on fewer iterations to reduce chances of failure.",
    "a4": "D. Avoid monolithic architecture by segmenting workloads.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 94,
    "q": "A company is designing its AWS workloads so that components can be updated regularly and so that changes can be made in small, reversible increments. Which pillar of the AWS Well-Architected Framework does this design support?",
    "a1": "A. Security",
    "a2": "B. Performance efficiency",
    "a3": "C. Operational excellence",
    "a4": "D. Reliability",
    "a5": "",
    "as": "C"
  },
  {
    "id": 95,
    "q": "Which of the following acts as an instance-level firewall to control inbound and outbound access?",
    "a1": "A. Network access control list",
    "a2": "B. Security groups",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. Virtual private gateways",
    "a5": "",
    "as": "B"
  },
  {
    "id": 96,
    "q": "A company has a workload that will run continuously for 1 year. The workload cannot tolerate service interruptions. Which Amazon EC2 purchasing option will be MOST cost-effective?",
    "a1": "A. All Upfront Reserved Instances",
    "a2": "B. Partial Upfront Reserved Instances",
    "a3": "C. Dedicated Instances",
    "a4": "D. On-Demand Instances",
    "a5": "",
    "as": "A"
  },
  {
    "id": 97,
    "q": "Which AWS service helps protect against DDoS attacks?",
    "a1": "A. AWS Shield",
    "a2": "B. Amazon Inspector",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. Amazon Detective",
    "a5": "",
    "as": "A"
  },
  {
    "id": 98,
    "q": "Using AWS Config to record, audit, and evaluate changes to AWS resources to enable traceability is an example of which AWS Well-Architected Framework pillar?",
    "a1": "A. Security",
    "a2": "B. Operational excellence",
    "a3": "C. Performance efficiency",
    "a4": "D. Cost optimization",
    "a5": "",
    "as": "A"
  },
  {
    "id": 99,
    "q": "Which AWS tool or feature acts as a VPC firewall at the subnet level?",
    "a1": "A. Security group",
    "a2": "B. Network ACL",
    "a3": "C. Traffic Mirroring",
    "a4": "D. Internet gateway",
    "a5": "",
    "as": "B"
  },
  {
    "id": 100,
    "q": "Which AWS service can be used to decouple applications?",
    "a1": "A. AWS Config",
    "a2": "B. Amazon Simple Queue Service (Amazon SQS)",
    "a3": "C. AWS Batch",
    "a4": "D. Amazon Simple Email Service (Amazon SES)",
    "a5": "",
    "as": "B"
  },
  {
    "id": 101,
    "q": "Which disaster recovery option is the LEAST expensive?",
    "a1": "A. Warm standby",
    "a2": "B. Multisite",
    "a3": "C. Backup and restore",
    "a4": "D. Pilot light",
    "a5": "",
    "as": "C"
  },
  {
    "id": 102,
    "q": "Which type of AWS storage is ephemeral and is deleted when an Amazon EC2 instance is stopped or terminated?",
    "a1": "A. Amazon Elastic Block Store (Amazon EBS)",
    "a2": "B. Amazon EC2 instance store",
    "a3": "C. Amazon Elastic File System (Amazon EFS)",
    "a4": "D. Amazon S3",
    "a5": "",
    "as": "B"
  },
  {
    "id": 103,
    "q": "Which of the following is a characteristic of the AWS account root user?",
    "a1": "A. The root user is the only user that can be configured with multi-factor authentication (MFA).",
    "a2": "B. The root user is the only user that can access the AWS Management Console.",
    "a3": "C. The root user is the first sign-in identity that is available when an AWS account is created.",
    "a4": "D. The root user has a password that cannot be changed.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 104,
    "q": "A company hosts an application on an Amazon EC2 instance. The EC2 instance needs to access several AWS resources, including Amazon S3 and Amazon DynamoDB. What is the MOST operationally efficient solution to delegate permissions?",
    "a1": "A. Create an IAM role with the required permissions. Attach the role to the EC2 instance.",
    "a2": "B. Create an IAM user and use its access key and secret access key in the application.",
    "a3": "C. Create an IAM user and use its access key and secret access key to create a CLI profile in the EC2 instance.",
    "a4": "D. Create an IAM role with the required permissions. Attach the role to the administrative IAM user.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 105,
    "q": "Which of the following is a component of the AWS Global Infrastructure?",
    "a1": "A. Amazon Alexa",
    "a2": "B. AWS Regions",
    "a3": "C. Amazon Lightsail",
    "a4": "D. AWS Organizations",
    "a5": "",
    "as": "B"
  },
  {
    "id": 106,
    "q": "What is the purpose of having an internet gateway within a VPC?",
    "a1": "A. To create a VPN connection to the VPC",
    "a2": "B. To allow communication between the VPC and the internet",
    "a3": "C. To impose bandwidth constraints on internet traffic",
    "a4": "D. To load balance traffic from the internet across Amazon EC2 instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 107,
    "q": "Which AWS service allows users to download security and compliance reports about the AWS infrastructure on demand?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS Security Hub",
    "a3": "C. AWS Artifact",
    "a4": "D. AWS Shield",
    "a5": "",
    "as": "C"
  },
  {
    "id": 108,
    "q": "A pharmaceutical company operates its infrastructure in a single AWS Region. The company has thousands of VPCs in a various AWS accounts that it wants to interconnect. Which AWS service or feature should the company use to help simplify management and reduce operational costs?",
    "a1": "A. VPC endpoint",
    "a2": "B. AWS Direct Connect",
    "a3": "C. AWS Transit Gateway",
    "a4": "D. VPC peering",
    "a5": "",
    "as": "D"
  },
  {
    "id": 109,
    "q": "A company is planning an infrastructure deployment to the AWS Cloud. Before the deployment, the company wants a cost estimate for running the infrastructure. Which AWS service or feature can provide this information?",
    "a1": "A. Cost Explorer",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. AWS Cost and Usage Report",
    "a4": "D. AWS Pricing Calculator",
    "a5": "",
    "as": "D"
  },
  {
    "id": 110,
    "q": "Which AWS service of tool helps to centrally manage billing and allow controlled access to resources across AWS accounts?",
    "a1": "A. AWS Identity and Access Management (IAM)",
    "a2": "B. AWS Organizations",
    "a3": "C. Cost Explorer",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "B"
  },
  {
    "id": 111,
    "q": "Which of the following are Amazon Virtual Private Cloud (Amazon VPC) resources?",
    "a1": "A. Objects; access control lists (ACLs)",
    "a2": "B. Subnets; internet gateways",
    "a3": "C. Access policies; buckets",
    "a4": "D. Groups; roles",
    "a5": "",
    "as": "B"
  },
  {
    "id": 112,
    "q": "A company needs to identify the last time that a specific user accessed the AWS Management Console. Which AWS service will provide this information?",
    "a1": "A. Amazon Cognito",
    "a2": "B. AWS CloudTrail",
    "a3": "C. Amazon Inspector",
    "a4": "D. Amazon GuardDuty",
    "a5": "",
    "as": "B"
  },
  {
    "id": 113,
    "q": "A company launched an Amazon EC2 instance with the latest Amazon Linux 2 Amazon Machine Image (AMI). Which actions can a system administrator take to connect to the EC2 instance? (Choose two.)",
    "a1": "A. Use Amazon EC2 Instance Connect.",
    "a2": "B. Use a Remote Desktop Protocol (RDP) connection.",
    "a3": "C. Use AWS Batch",
    "a4": "D. Use AWS Systems Manager Session Manager.",
    "a5": "E. Use Amazon Connect",
    "as": "AD"
  },
  {
    "id": 114,
    "q": "A company wants to perform sentiment analysis on customer service email messages that it receives. The company wants to identify whether the customer service engagement was positive or negative. Which AWS service should the company use to perform this analysis?",
    "a1": "A. Amazon Textract",
    "a2": "B. Amazon Translate",
    "a3": "C. Amazon Comprehend",
    "a4": "D. Amazon Rekognition",
    "a5": "",
    "as": "C"
  },
  {
    "id": 115,
    "q": "What is the total amount of storage offered by Amazon S3?",
    "a1": "A. 100MB",
    "a2": "B. 5 GB",
    "a3": "C. 5 TB",
    "a4": "D. Unlimited",
    "a5": "",
    "as": "D"
  },
  {
    "id": 116,
    "q": "A company is migrating to Amazon S3. The company needs to transfer 60 TB of data from an on-premises data center to AWS within 10 days. Which AWS service should the company use to accomplish this migration?",
    "a1": "A. Amazon S3 Glacier",
    "a2": "B. AWS Database Migration Service (AWS DMS)",
    "a3": "C. AWS Snowball",
    "a4": "D. AWS Direct Connect",
    "a5": "",
    "as": "C"
  },
  {
    "id": 117,
    "q": "What type of database is Amazon DynamoDB?",
    "a1": "A. In-memory",
    "a2": "B. Relational",
    "a3": "C. Key-value",
    "a4": "D. Graph",
    "a5": "",
    "as": "C"
  },
  {
    "id": 118,
    "q": "A large organization has a single AWS account. What are the advantages of reconfiguring the single account into multiple AWS accounts? (Choose two.)",
    "a1": "A. It allows for administrative isolation between different workloads.",
    "a2": "B. Discounts can be applied on a quarterly basis by submitting cases in the AWS Management Console.",
    "a3": "C. Transitioning objects from Amazon S3 to Amazon S3 Glacier in separate AWS accounts will be less expensive.",
    "a4": "D. Having multiple accounts reduces the risks associated with malicious activity targeted at a single account.",
    "a5": "E. Amazon QuickSight offers access to a cost tool that provides application-specific recommendations for environments running in multiple accounts.",
    "as": "AD"
  },
  {
    "id": 119,
    "q": "A retail company has recently migrated its website to AWS. The company wants to ensure that it is protected from SQL injection attacks. The website uses an Application Load Balancer to distribute traffic to multiple Amazon EC2 instances. Which AWS service or feature can be used to create a custom rule that blocks SQL injection attacks?",
    "a1": "A. Security groups",
    "a2": "B. AWS WAF",
    "a3": "C. Network ACLs",
    "a4": "D. AWS Shield",
    "a5": "",
    "as": "B"
  },
  {
    "id": 120,
    "q": "Which AWS service provides a feature that can be used to proactively monitor and plan for the service quotas of AWS resources?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. AWS Personal Health Dashboard",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "C"
  },
  {
    "id": 121,
    "q": "Which of the following is an advantage that users experience when they move on-premises workloads to the AWS Cloud?",
    "a1": "A. Elimination of expenses for running and maintaining data centers",
    "a2": "B. Price discounts that are identical to discounts from hardware providers",
    "a3": "C. Distribution of all operational controls to AWS",
    "a4": "D. Elimination of operational expenses",
    "a5": "",
    "as": "A"
  },
  {
    "id": 122,
    "q": "Which design principle is included in the operational excellence pillar of the AWS Well-Architected Framework?",
    "a1": "A. Create annotated documentation.",
    "a2": "B. Anticipate failure.",
    "a3": "C. Ensure performance efficiency.",
    "a4": "D. Optimize costs.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 123,
    "q": "Which AWS services offer gateway VPC endpoints that can be used to avoid sending traffic over the internet? (Choose two.)",
    "a1": "A. Amazon Simple Notification Service (Amazon SNS)",
    "a2": "B. Amazon Simple Queue Service (Amazon SQS)",
    "a3": "C. AWS CodeBuild",
    "a4": "D. Amazon S3",
    "a5": "E. Amazon DynamoDB",
    "as": "DE"
  },
  {
    "id": 124,
    "q": "Which of the following is the customer responsible for updating and patching, according to the AWS shared responsibility model?",
    "a1": "A. Amazon FSx for Windows File Server",
    "a2": "B. Amazon WorkSpaces virtual Windows desktop",
    "a3": "C. AWS Directory Service for Microsoft Active Directory",
    "a4": "D. Amazon RDS for Microsoft SQL Server",
    "a5": "",
    "as": "B"
  },
  {
    "id": 125,
    "q": "Who has the responsibility to patch the host operating system of an Amazon EC2 instance, according to the AWS shared responsibility model?",
    "a1": "A. Both AWS and the customer",
    "a2": "B. The customer only",
    "a3": "C. The EC2 hardware manufacturer",
    "a4": "D. AWS only",
    "a5": "",
    "as": "D"
  },
  {
    "id": 126,
    "q": "A company is using an Amazon RDS DB instance for an application that is deployed in the AWS Cloud. The company needs regular patching of the operating system of the server where the DB instance runs. What is the company's responsibility in this situation, according to the AWS shared responsibility model?",
    "a1": "A. Open a support case to obtain administrative access to the server so that the company can patch the DB instance operating system.",
    "a2": "B. Open a support case and request that AWS patch the DB instance operating system.",
    "a3": "C. Use administrative access to the server, and apply the operating system patches during the regular maintenance window that is defined for the DB instance.",
    "a4": "D. Establish a regular maintenance window that tells AWS when to patch the DB instance operating system.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 127,
    "q": "Why is an AWS Well-Architected review a critical part of the cloud design process?",
    "a1": "A. A Well-Architected review is mandatory before a workload can run on AWS.",
    "a2": "B. A Well-Architected review helps identify design gaps and helps evaluate design decisions and related documents.",
    "a3": "C. A Well-Architected review is an audit mechanism that is a part of requirements for service level agreements.",
    "a4": "D. A Well-Architected review eliminates the need for ongoing auditing and compliance tests.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 128,
    "q": "A company implements an Amazon EC2 Auto Scaling policy along with an Application Load Balancer to automatically recover unhealthy applications that run on Amazon EC2 instances. Which pillar of the AWS Well-Architected Framework does this action cover?",
    "a1": "A. Security",
    "a2": "B. Performance efficiency",
    "a3": "C. Operational excellence",
    "a4": "D. Reliability",
    "a5": "",
    "as": "D"
  },
  {
    "id": 129,
    "q": "Which AWS Cloud benefit is shown by an architecture's ability to withstand failures with minimal downtime?",
    "a1": "A. Agility",
    "a2": "B. Elasticity",
    "a3": "C. Scalability",
    "a4": "D. High availability",
    "a5": "",
    "as": "D"
  },
  {
    "id": 130,
    "q": "Under the AWS shared responsibility model, which task is the customer's responsibility when managing AWS Lambda functions?",
    "a1": "A. Creating versions of Lambda functions",
    "a2": "B. Maintaining server and operating systems",
    "a3": "C. Scaling Lambda resources according to demand",
    "a4": "D. Updating the Lambda runtime environment",
    "a5": "",
    "as": "A"
  },
  {
    "id": 131,
    "q": "What does the AWS Concierge Support team provide?",
    "a1": "A. A technical expert dedicated to the user",
    "a2": "B. A primary point of contact for AWS Billing and AWS Support",
    "a3": "C. A partner to help provide scaling guidance for an event launch",
    "a4": "D. A dedicated AWS staff member who reviews the user's application architecture",
    "a5": "",
    "as": "B"
  },
  {
    "id": 132,
    "q": "A company needs to generate reports that can break down cloud costs by product, by company-defined tags, and by hour, day, and month. Which AWS tool should the company use to meet these requirements?",
    "a1": "A. Reserved Instance utilization and coverage reports",
    "a2": "B. Savings Plans utilization reports",
    "a3": "C. AWS Budgets reports",
    "a4": "D. AWS Cost and Usage Reports",
    "a5": "",
    "as": "D"
  },
  {
    "id": 133,
    "q": "A company has a serverless application that includes an Amazon API Gateway API, an AWS Lambda function, and an Amazon DynamoDB database. Which AWS service can the company use to trace user requests as they move through the application's components?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. Amazon CloudWatch",
    "a3": "C. Amazon Inspector",
    "a4": "D. AWS X-Ray",
    "a5": "",
    "as": "D"
  },
  {
    "id": 134,
    "q": "A company needs to set up a petabyte-scale data warehouse in the AWS Cloud. Which AWS service will meet this requirement?",
    "a1": "A. Amazon DynamoDB",
    "a2": "B. Amazon RDS",
    "a3": "C. Amazon Redshift",
    "a4": "D. Amazon ElastiCache",
    "a5": "",
    "as": "C"
  },
  {
    "id": 135,
    "q": "Which AWS service is always provided at no charge?",
    "a1": "A. Amazon S3",
    "a2": "B. AWS Identity and Access Management (IAM)",
    "a3": "C. Elastic Load Balancers",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "B"
  },
  {
    "id": 136,
    "q": "A company needs to design an AWS disaster recovery plan to cover multiple geographic areas. Which action will meet this requirement?",
    "a1": "A. Configure multiple AWS accounts.",
    "a2": "B. Configure the architecture across multiple Availability Zones in an AWS Region.",
    "a3": "C. Configure the architecture across multiple AWS Regions.",
    "a4": "D. Configure the architecture among many edge locations.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 137,
    "q": "Which of the following is a benefit of moving from an on-premises data center to the AWS Cloud?",
    "a1": "A. Compute instances can be launched and terminated as needed to optimize costs.",
    "a2": "B. Compute costs can be viewed in the AWS Billing and Cost Management console.",
    "a3": "C. Users retain full administrative access to their compute instances.",
    "a4": "D. Users can optimize costs by permanently running enough instances at peak load.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 138,
    "q": "In which ways does the AWS Cloud offer lower total cost of ownership (TCO) of computing resources than on-premises data centers? (Choose two.)",
    "a1": "A. AWS replaces upfront capital expenditures with pay-as-you-go costs.",
    "a2": "B. AWS is designed for high availability, which eliminates user downtime.",
    "a3": "C. AWS eliminates the need for on-premises IT staff.",
    "a4": "D. AWS uses economies of scale to continually reduce prices.",
    "a5": "E. AWS offers a single pricing model for Amazon EC2 instances.",
    "as": "AD"
  },
  {
    "id": 139,
    "q": "Which AWS service monitors AWS accounts for security threats?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS Secrets Manager",
    "a3": "C. Amazon Cognito",
    "a4": "D. AWS Certificate Manager (ACM)",
    "a5": "",
    "as": "A"
  },
  {
    "id": 140,
    "q": "Which benefit is included with an AWS Enterprise Support plan?",
    "a1": "A. AWS Partner Network (APN) support at no cost.",
    "a2": "B. Designated support from an AWS technical account manager (TAM)",
    "a3": "C. On-site support from AWS engineers",
    "a4": "D. AWS managed compliance as code with AWS Config",
    "a5": "",
    "as": "B"
  },
  {
    "id": 141,
    "q": "Which task does AWS perform automatically?",
    "a1": "A. Encrypt data that is stored in Amazon DynamoDB.",
    "a2": "B. Patch Amazon EC2 instances.",
    "a3": "C. Encrypt user network traffic.",
    "a4": "D. Create TLS certificates for users' websites.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 142,
    "q": "Which AWS service or tool can a company use to visualize, understand, and manage AWS spending and usage over time?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. Amazon CloudWatch",
    "a3": "C. Cost Explorer",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "C"
  },
  {
    "id": 143,
    "q": "A company wants to deploy some of its resources in the AWS Cloud. To meet regulatory requirements, the data must remain local and on premises. There must be low latency between AWS and the company resources. Which AWS service or feature can be used to meet these requirements?",
    "a1": "A. AWS Local Zones",
    "a2": "B. Availability Zones",
    "a3": "C. AWS Outposts",
    "a4": "D. AWS Wavelength Zones",
    "a5": "",
    "as": "C"
  },
  {
    "id": 144,
    "q": "A company requires an isolated environment within AWS for security purposes. Which action can be taken to accomplish this?",
    "a1": "A. Create a separate Availability Zone to host the resources.",
    "a2": "B. Create a separate VPC to host the resources.",
    "a3": "C. Create a placement group to host the resources.",
    "a4": "D. Create an AWS Direct Connect connection between the company and AWS.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 145,
    "q": "Which AWS service is a highly available and scalable DNS web service?",
    "a1": "A. Amazon VPC",
    "a2": "B. Amazon CloudFront",
    "a3": "C. Amazon Route 53",
    "a4": "D. Amazon Connect",
    "a5": "",
    "as": "C"
  },
  {
    "id": 146,
    "q": "Which of the following is an AWS best practice for managing an AWS account root user?",
    "a1": "A. Keep the root user password with the security team.",
    "a2": "B. Enable multi-factor authentication (MFA) for the root user.",
    "a3": "C. Create an access key for the root user.",
    "a4": "D. Keep the root user password consistent for compliance purposes.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 147,
    "q": "A company wants to improve its security and audit posture by limiting Amazon EC2 inbound access. What should the company use to access instances remotely instead of opening inbound SSH ports and managing SSH keys?",
    "a1": "A. EC2 key pairs",
    "a2": "B. AWS Systems Manager Session Manager",
    "a3": "C. AWS Identity and Access Management (IAM)",
    "a4": "D. Network ACLs",
    "a5": "",
    "as": "B"
  },
  {
    "id": 148,
    "q": "After selecting an Amazon EC2 Dedicated Host reservation, which pricing option would provide the largest discount?",
    "a1": "A. No upfront payment",
    "a2": "B. Hourly on-demand payment",
    "a3": "C. Partial upfront payment",
    "a4": "D. All upfront payment",
    "a5": "",
    "as": "D"
  },
  {
    "id": 149,
    "q": "A company has refined its workload to use specific AWS services to improve efficiency and reduce cost. Which best practice for cost governance does this example show?",
    "a1": "A. Resource controls",
    "a2": "B. Cost allocation",
    "a3": "C. Architecture optimization",
    "a4": "D. Tagging enforcement",
    "a5": "",
    "as": "C"
  },
  {
    "id": 150,
    "q": "A company would like to host its MySQL databases on AWS and maintain full control over the operating system, database installation, and configuration. Which AWS service should the company use to host the databases?",
    "a1": "A. Amazon RDS",
    "a2": "B. Amazon EC2",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon Aurora",
    "a5": "",
    "as": "B"
  },
  {
    "id": 151,
    "q": "How does the AWS global infrastructure offer high availability and fault tolerance to its users?",
    "a1": "A. The AWS infrastructure is made up of multiple AWS Regions within various Availability Zones located in areas that have low flood risk, and are interconnected with low-latency networks and redundant power supplies.",
    "a2": "B. The AWS infrastructure consists of subnets containing various Availability Zones with multiple data centers located in the same geographic location.",
    "a3": "C. AWS allows users to choose AWS Regions and data centers so that users can select the closest data centers in different Regions.",
    "a4": "D. The AWS infrastructure consists of isolated AWS Regions with independent Availability Zones that are connected with low-latency networking and redundant power supplies.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 152,
    "q": "A company is using Amazon EC2 Auto Scaling to scale its Amazon EC2 instances. Which benefit of the AWS Cloud does this example illustrate?",
    "a1": "A. High availability",
    "a2": "B. Elasticity",
    "a3": "C. Reliability",
    "a4": "D. Global reach",
    "a5": "",
    "as": "B"
  },
  {
    "id": 153,
    "q": "Which AWS service or feature is used to send both text and email messages from distributed applications?",
    "a1": "A. Amazon Simple Notification Service (Amazon SNS)",
    "a2": "B. Amazon Simple Email Service (Amazon SES)",
    "a3": "C. Amazon CloudWatch alerts",
    "a4": "D. Amazon Simple Queue Service (Amazon SQS)",
    "a5": "",
    "as": "A"
  },
  {
    "id": 154,
    "q": "A user is able to set up a master payer account to view consolidated billing reports through:",
    "a1": "A. AWS Budgets.",
    "a2": "B. Amazon Macie.",
    "a3": "C. Amazon QuickSight.",
    "a4": "D. AWS Organizations.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 155,
    "q": "According to the AWS shared responsibility model, which task is the customer's responsibility?",
    "a1": "A. Maintaining the infrastructure needed to run AWS Lambda",
    "a2": "B. Updating the operating system of Amazon DynamoDB instances",
    "a3": "C. Maintaining Amazon S3 infrastructure",
    "a4": "D. Updating the guest operating system on Amazon EC2 instances",
    "a5": "",
    "as": "D"
  },
  {
    "id": 156,
    "q": "A company wants to migrate a small website and database quickly from on-premises infrastructure to the AWS Cloud. The company has limited operational knowledge to perform the migration. Which AWS service supports this use case?",
    "a1": "A. Amazon EC2",
    "a2": "B. Amazon Lightsail",
    "a3": "C. Amazon S3",
    "a4": "D. AWS Lambda",
    "a5": "",
    "as": "B"
  },
  {
    "id": 157,
    "q": "A company is moving multiple applications to a single AWS account. The company wants to monitor the AWS Cloud costs incurred by each application. What can the company do to meet this requirement?",
    "a1": "A. Set up invoiced billing.",
    "a2": "B. Use AWS Artifact.",
    "a3": "C. Set budgets in Cost Explorer.",
    "a4": "D. Create cost allocation tags.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 158,
    "q": "Which design principle is achieved by following the reliability pillar of the AWS Well-Architected Framework?",
    "a1": "A. Vertical scaling",
    "a2": "B. Manual failure recovery",
    "a3": "C. Testing recovery procedures",
    "a4": "D. Changing infrastructure manually",
    "a5": "",
    "as": "C"
  },
  {
    "id": 159,
    "q": "A user needs to quickly deploy a non-relational database on AWS. The user does not want to manage the underlying hardware or the database software. Which AWS service can be used to accomplish this?",
    "a1": "A. Amazon RDS",
    "a2": "B. Amazon DynamoDB",
    "a3": "C. Amazon Aurora",
    "a4": "D. Amazon Redshift",
    "a5": "",
    "as": "B"
  },
  {
    "id": 160,
    "q": "Which task is an AWS responsibility when a workload is running in Amazon RDS?",
    "a1": "A. Creating the database table",
    "a2": "B. Updating the database schema",
    "a3": "C. Installing the database engine",
    "a4": "D. Dropping the database records",
    "a5": "",
    "as": "C"
  },
  {
    "id": 161,
    "q": "A development team wants to publish and manage web services that provide REST APIs. Which AWS service will meet this requirement?",
    "a1": "A. AWS App Mesh",
    "a2": "B. Amazon API Gateway",
    "a3": "C. Amazon CloudFront",
    "a4": "D. AWS Cloud Map",
    "a5": "",
    "as": "B"
  },
  {
    "id": 162,
    "q": "A company has a social media platform in which users upload and share photos with other users. The company wants to identify and remove inappropriate photos. The company has no machine learning (ML) scientists and must build this detection capability with no ML expertise. Which AWS service should the company use to build this capability?",
    "a1": "A. Amazon SageMaker",
    "a2": "B. Amazon Textract",
    "a3": "C. Amazon Rekognition",
    "a4": "D. Amazon Comprehend",
    "a5": "",
    "as": "C"
  },
  {
    "id": 163,
    "q": "Which responsibility belongs to AWS when a company hosts its databases on Amazon EC2 instances?",
    "a1": "A. Database backups",
    "a2": "B. Database software patches",
    "a3": "C. Operating system patches",
    "a4": "D. Operating system installations.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 164,
    "q": "A company wants to use Amazon S3 to store its legacy data. The data is rarely accessed. However, the data is critical and cannot be recreated. The data needs to be available for retrieval within seconds. Which S3 storage class meets these requirements MOST cost-effectively?",
    "a1": "A. S3 Standard",
    "a2": "B. S3 One Zone-Infrequent Access (S3 One Zone-IA)",
    "a3": "C. S3 Standard-Infrequent Access (S3 Standard-IA)",
    "a4": "D. S3 Glacier",
    "a5": "",
    "as": "C"
  },
  {
    "id": 165,
    "q": "An online retail company wants to migrate its on-premises workload to AWS. The company needs to automatically handle a seasonal workload increase in a cost- effective manner. Which AWS Cloud features will help the company meet this requirement? (Choose two.)",
    "a1": "A. Cross-Region workload deployment",
    "a2": "B. Pay-as-you-go pricing",
    "a3": "C. Built-in AWS CloudTrail audit capabilities",
    "a4": "D. Auto Scaling policies",
    "a5": "E. Centralized logging",
    "as": "BD"
  },
  {
    "id": 166,
    "q": "Which AWS service helps developers use loose coupling and reliable messaging between microservices?",
    "a1": "A. Elastic Load Balancing",
    "a2": "B. Amazon Simple Notification Service (Amazon SNS)",
    "a3": "C. Amazon CloudFront",
    "a4": "D. Amazon Simple Queue Service (Amazon SQS)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 167,
    "q": "A company needs to build an application that uses AWS services. The application will be delivered to residents in European Counties. The company must abide by regional regulatory requirements. Which AWS service or program should the company use to determine which AWS services meet the regional requirements?",
    "a1": "A. AWS Audit Manager",
    "a2": "B. AWS Shield",
    "a3": "C. AWS Compliance Program",
    "a4": "D. AWS Artifact",
    "a5": "",
    "as": "C"
  },
  {
    "id": 168,
    "q": "A company needs to implement identity management for a fleet of mobile apps that are running in the AWS Cloud. Which AWS service will meet this requirement?",
    "a1": "A. Amazon Cognito",
    "a2": "B. AWS Security Hub",
    "a3": "C. AWS Shield",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "A"
  },
  {
    "id": 169,
    "q": "A company needs an Amazon EC2 instance for a rightsized database server that must run constantly for 1 year. Which EC2 instance purchasing option will meet these requirements MOST cost-effectively?",
    "a1": "A. Standard Reserved Instance",
    "a2": "B. Convertible Reserved Instance",
    "a3": "C. On-Demand Instance",
    "a4": "D. Spot Instance",
    "a5": "",
    "as": "A"
  },
  {
    "id": 170,
    "q": "A company has multiple applications and is now building a new multi-tier application. The company will host the new application on Amazon EC2 instances. The company wants the network routing and traffic between the various applications to follow the security principle of least privilege. Which AWS service or feature should the company use to enforce this principle?",
    "a1": "A. Security groups",
    "a2": "B. AWS Shield",
    "a3": "C. AWS Global Accelerator",
    "a4": "D. AWS Direct Connect gateway",
    "a5": "",
    "as": "A"
  },
  {
    "id": 171,
    "q": "A company's web application requires AWS credentials and authorizations to use an AWS service. Which IAM entity should the company use as best practice?",
    "a1": "A. IAM role",
    "a2": "B. IAM user",
    "a3": "C. IAM group",
    "a4": "D. IAM multi-factor authentication (MFA)",
    "a5": "",
    "as": "A"
  },
  {
    "id": 172,
    "q": "A company is creating a document that defines the operating system patch routine for all the company's systems. Which AWS resources should the company include in this document? (Choose two.)",
    "a1": "A. Amazon EC2 instances",
    "a2": "B. AWS Lambda functions",
    "a3": "C. AWS Fargate tasks",
    "a4": "D. Amazon RDS instances",
    "a5": "E. Amazon Elastic Container Service (Amazon ECS) instances",
    "as": "AD"
  },
  {
    "id": 173,
    "q": "Which AWS service or feature gives a company the ability to control incoming traffic and outgoing traffic for Amazon EC2 instances?",
    "a1": "A. Security groups",
    "a2": "B. Amazon Route 53",
    "a3": "C. AWS Direct Connect",
    "a4": "D. Amazon VPC",
    "a5": "",
    "as": "A"
  },
  {
    "id": 174,
    "q": "A company is starting to build its infrastructure in the AWS Cloud. The company wants access to technical support during business hours. The company also wants general architectural guidance as teams build and test new applications. Which AWS Support plan will meet these requirements at the LOWEST cost?",
    "a1": "A. AWS Basic Support",
    "a2": "B. AWS Developer Support",
    "a3": "C. AWS Business Support",
    "a4": "D. AWS Enterprise Support",
    "a5": "",
    "as": "B"
  },
  {
    "id": 175,
    "q": "A company is migrating its public website to AWS. The company wants to host the domain name for the website on AWS. Which AWS service should the company use to meet this requirement?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon Route 53",
    "a3": "C. Amazon CloudFront",
    "a4": "D. AWS Direct Connect",
    "a5": "",
    "as": "B"
  },
  {
    "id": 176,
    "q": "A company needs to evaluate its AWS environment and provide best practice recommendations in five categories: cost, performance, service limits, fault tolerance, and security. Which AWS service can the company use to meet these requirements?",
    "a1": "A. AWS Shield",
    "a2": "B. AWS WAF",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Service Catalog",
    "a5": "",
    "as": "C"
  },
  {
    "id": 177,
    "q": "Which AWS service provides the capability to view end-to-end performance metrics and troubleshoot distributed applications?",
    "a1": "A. AWS Cloud9",
    "a2": "B. AWS CodeStar",
    "a3": "C. AWS Cloud Map",
    "a4": "D. AWS X-Ray",
    "a5": "",
    "as": "D"
  },
  {
    "id": 178,
    "q": "Which cloud computing benefit does AWS demonstrate with its ability to offer lower variable costs as a result of high purchase volumes?",
    "a1": "A. Pay-as-you-go pricing",
    "a2": "B. High availability",
    "a3": "C. Global reach",
    "a4": "D. Economies of scale",
    "a5": "",
    "as": "D"
  },
  {
    "id": 179,
    "q": "Which AWS service provides threat detection by monitoring for malicious activities and unauthorized actions to protect AWS accounts, workloads, and data that is stored in Amazon S3?",
    "a1": "A. AWS Shield",
    "a2": "B. AWS Firewall Manager",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "C"
  },
  {
    "id": 180,
    "q": "Which AWS service can a company use to store and manage Docker images?",
    "a1": "A. Amazon DynamoDB",
    "a2": "B. Amazon Kinesis Data Streams",
    "a3": "C. Amazon Elastic Container Registry (Amazon ECR)",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 181,
    "q": "A company needs an automated security assessment report that will identify unintended network access to Amazon EC2 instances. The report also must identify operating system vulnerabilities on those instances. Which AWS service or feature should the company use to meet this requirement?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. Security groups",
    "a3": "C. Amazon Macie",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "D"
  },
  {
    "id": 182,
    "q": "A global company is building a simple time-tracking mobile app. The app needs to operate globally and must store collected data in a database. Data must be accessible from the AWS Region that is closest to the user. What should the company do to meet these data storage requirements with the LEAST amount of operational overhead?",
    "a1": "A. Use Amazon EC2 in multiple Regions to host separate databases",
    "a2": "B. Use Amazon RDS cross-Region replication",
    "a3": "C. Use Amazon DynamoDB global tables",
    "a4": "D. Use AWS Database Migration Service (AWS DMS)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 183,
    "q": "Which of the following are economic advantages of the AWS Cloud? (Choose two.)",
    "a1": "A. Increased workforce productivity",
    "a2": "B. Decreased need to encrypt user data",
    "a3": "C. Manual compliance audits",
    "a4": "D. Simplified total cost of ownership (TCO) accounting",
    "a5": "E. Faster product launches",
    "as": "AE"
  },
  {
    "id": 184,
    "q": "Which controls does the customer fully inherit from AWS in the AWS shared responsibility model?",
    "a1": "A. Patch management controls",
    "a2": "B. Awareness and training controls",
    "a3": "C. Physical and environmental controls",
    "a4": "D. Configuration management controls",
    "a5": "",
    "as": "C"
  },
  {
    "id": 185,
    "q": "Which task is a customer's responsibility, according to the AWS shared responsibility model?",
    "a1": "A. Management of the guest operating systems",
    "a2": "B. Maintenance of the configuration of infrastructure devices",
    "a3": "C. Management of the host operating systems and virtualization",
    "a4": "D. Maintenance of the software that powers Availability Zones",
    "a5": "",
    "as": "A"
  },
  {
    "id": 186,
    "q": "A company needs to deliver new website features quickly in an iterative manner to minimize the time to market. Which AWS Cloud concept does this requirement represent?",
    "a1": "A. Reliability",
    "a2": "B. Elasticity",
    "a3": "C. Agility",
    "a4": "D. High availability",
    "a5": "",
    "as": "C"
  },
  {
    "id": 187,
    "q": "A company wants to increase its ability to recover its infrastructure in the case of a natural disaster. Which pillar of the AWS Well-Architected Framework does this ability represent?",
    "a1": "A. Cost optimization",
    "a2": "B. Performance efficiency",
    "a3": "C. Reliability",
    "a4": "D. Security",
    "a5": "",
    "as": "C"
  },
  {
    "id": 188,
    "q": "Which AWS service tracks API calls and user activity?",
    "a1": "A. AWS Organizations",
    "a2": "B. AWS Config",
    "a3": "C. Amazon CloudWatch",
    "a4": "D. AWS CloudTrail",
    "a5": "",
    "as": "D"
  },
  {
    "id": 189,
    "q": "Which AWS service, feature, or tool uses machine learning to continuously monitor cost and usage for unusual cloud spending?",
    "a1": "A. Amazon Lookout for Metrics",
    "a2": "B. AWS Budgets",
    "a3": "C. Amazon CloudWatch",
    "a4": "D. AWS Cost Anomaly Detection",
    "a5": "",
    "as": "D"
  },
  {
    "id": 190,
    "q": "A company deployed an application on an Amazon EC2 instance. The application ran as expected for 6 months in the past week, users have reported latency issues. A system administrator found that the CPU utilization was at 100% during business hours. The company wants a scalable solution to meet demand. Which AWS service or feature should the company use to handle the load for its application during periods of high demand?",
    "a1": "A. Auto Scaling groups",
    "a2": "B. AWS Global Accelerator",
    "a3": "C. Amazon Route 53",
    "a4": "D. An Elastic IP address",
    "a5": "",
    "as": "A"
  },
  {
    "id": 191,
    "q": "A company wants to migrate to AWS and use the same security software it uses on premises. The security software vendor offers its security software as a service on AWS. Where can the company purchase the security solution?",
    "a1": "A. AWS Partner Solutions Finder",
    "a2": "B. AWS Support Center",
    "a3": "C. AWS Management Console",
    "a4": "D. AWS Marketplace",
    "a5": "",
    "as": "D"
  },
  {
    "id": 192,
    "q": "A company is generating large sets of critical data in its on-premises data center. The company needs to securely transfer the data to AWS for processing. These transfers must occur daily over a dedicated connection. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS Backup",
    "a2": "B. AWS DataSync",
    "a3": "C. AWS Direct Connect",
    "a4": "D. AWS Snowball",
    "a5": "",
    "as": "C"
  },
  {
    "id": 193,
    "q": "A company wants to run production workloads on AWS. The company wants access to technical support from engineers 24 hours a day, 7 days a week. The company also wants access to the AWS Health API and contextual architectural guidance for business use cases. The company has a strong IT support team and does not need concierge support. Which AWS Support plan will meet these requirements at the LOWEST cost?",
    "a1": "A. AWS Basic Support",
    "a2": "B. AWS Developer Support",
    "a3": "C. AWS Business Support",
    "a4": "D. AWS Enterprise Support",
    "a5": "",
    "as": "C"
  },
  {
    "id": 194,
    "q": "Which of the following is a managed AWS service that is used specifically for extract, transform, and load (ETL) data?",
    "a1": "A. Amazon Athena",
    "a2": "B. AWS Glue",
    "a3": "C. Amazon S3",
    "a4": "D. AWS Snowball Edge",
    "a5": "",
    "as": "B"
  },
  {
    "id": 195,
    "q": "Which of the following actions are controlled with AWS Identity and Access Management (IAM)? (Choose two.)",
    "a1": "A. Control access to AWS service APIs and to other specific resources",
    "a2": "B. Provide intelligent threat detection and continuous monitoring.",
    "a3": "C. Protect the AWS environment using multi-factor authentication (MFA).",
    "a4": "D. Grant users access to AWS data centers.",
    "a5": "E. Provide firewall protection for applications from common web attacks.",
    "as": "AC"
  },
  {
    "id": 196,
    "q": "Which of the following are shared controls that apply to both AWS and the customer, according to the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Resource configuration management",
    "a2": "B. Network data integrity",
    "a3": "C. Employee awareness and training",
    "a4": "D. Physical and environmental security",
    "a5": "E. Replacement and disposal of disk drives",
    "as": "AC"
  },
  {
    "id": 197,
    "q": "What information is found on an AWS Identity and Access Management (IAM) credential report? (Choose two.)",
    "a1": "A. The date and time when an IAM user's password was last used to sign in to the AWS Management Console.",
    "a2": "B. The type of multi-factor authentication (MFA) device assigned to an IAM user.",
    "a3": "C. The User-Agent browser identifier for each IAM user currently logged in.",
    "a4": "D. Whether multi-factor authentication (MFA) has been enabled for an IAM user.",
    "a5": "E. The number of incorrect login attempts by each IAM user in the previous 30 days.",
    "as": "AD"
  },
  {
    "id": 198,
    "q": "What is the LEAST expensive AWS Support plan that contains a full set of AWS Trusted Advisor best practice checks?",
    "a1": "A. AWS Enterprise Support",
    "a2": "B. AWS Business Support",
    "a3": "C. AWS Developer Support",
    "a4": "D. AWS Basic Support",
    "a5": "",
    "as": "B"
  },
  {
    "id": 199,
    "q": "Which AWS service provides domain registration, DNS routing, and service health checks?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. Amazon Route 53",
    "a3": "C. Amazon CloudFront",
    "a4": "D. Amazon API Gateway",
    "a5": "",
    "as": "B"
  },
  {
    "id": 200,
    "q": "A bank needs to store recordings of calls made to its contact center for 6 years. The recordings must be accessible within 48 hours from the time they are requested. Which AWS service will provide a secure and cost-effective solution for retaining these files?",
    "a1": "A. Amazon DynamoDB",
    "a2": "B. Amazon S3 Glacier",
    "a3": "C. Amazon Connect",
    "a4": "D. Amazon ElastiCache",
    "a5": "",
    "as": "B"
  },
  {
    "id": 201,
    "q": "Which AWS service should be used to migrate a company's on-premises MySQL database to Amazon RDS?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. AWS Server Migration Service (AWS SMS)",
    "a3": "C. AWS Database Migration Service (AWS DMS)",
    "a4": "D. AWS Schema Conversion Tool (AWS SCT)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 202,
    "q": "Which benefits does a company gain when the company moves from on-premises IT architecture to the AWS Cloud? (Choose two.)",
    "a1": "A. Reduced or eliminated tasks for hardware troubleshooting, capacity planning, and procurement",
    "a2": "B. Elimination of the need for trained IT staff",
    "a3": "C. Automatic security configuration of all applications that are migrated to the cloud",
    "a4": "D. Elimination of the need for disaster recovery planning",
    "a5": "E. Faster deployment of new features and applications",
    "as": "AE"
  },
  {
    "id": 203,
    "q": "Which of the following is a benefit of decoupling an AWS Cloud architecture?",
    "a1": "A. Reduced latency",
    "a2": "B. Ability to upgrade components independently",
    "a3": "C. Decreased costs",
    "a4": "D. Fewer components to manage",
    "a5": "",
    "as": "B"
  },
  {
    "id": 204,
    "q": "Which task is the responsibility of the customer according to the AWS shared responsibility model?",
    "a1": "A. Maintain the security of the hardware that runs Amazon EC2 instances.",
    "a2": "B. Patch the guest operating system of Amazon EC2 instances.",
    "a3": "C. Protect the security of the AWS global infrastructure.",
    "a4": "D. Patch Amazon RDS software.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 205,
    "q": "Which AWS Organizations feature can be used to track charges across multiple accounts and report the combined cost?",
    "a1": "A. Service control policies (SCPs)",
    "a2": "B. Cost Explorer",
    "a3": "C. Consolidated billing",
    "a4": "D. AWS Identity and Access Management (IAM)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 206,
    "q": "Which of the following is a cloud benefit that AWS offers to its users?",
    "a1": "A. The ability to configure AWS data center hypervisors",
    "a2": "B. The ability to purchase hardware in advance of increased traffic",
    "a3": "C. The ability to deploy to AWS on a global scale",
    "a4": "D. Compliance audits for user IT environments",
    "a5": "",
    "as": "C"
  },
  {
    "id": 207,
    "q": "An ecommerce company has migrated its IT infrastructure from an on-premises data center to the AWS Cloud. Which cost is the company's direct responsibility?",
    "a1": "A. Cost of application software licenses",
    "a2": "B. Cost of the hardware infrastructure on AWS",
    "a3": "C. Cost of power for the AWS servers",
    "a4": "D. Cost of physical security for the AWS data center",
    "a5": "",
    "as": "A"
  },
  {
    "id": 208,
    "q": "What are the five pillars of the AWS Well-Architected Framework?",
    "a1": "A. Encryption, documentation, speed, hybrid design, and cost optimization",
    "a2": "B. Containerization, cost margins, globalization, marketplace, and developer operations",
    "a3": "C. Network, compute, storage, security, and developer operations",
    "a4": "D. Operational excellence, reliability, performance efficiency, security, and cost optimization",
    "a5": "",
    "as": "D"
  },
  {
    "id": 209,
    "q": "A company accepts enrollment applications on handwritten paper forms. The company uses a manual process to enter the form data into its backend systems. The company wants to automate the process by scanning the forms and capturing the enrollment data from scanned PDF files. Which AWS service should the company use to build this process?",
    "a1": "A. Amazon Rekognition",
    "a2": "B. Amazon Textract",
    "a3": "C. Amazon Transcribe",
    "a4": "D. Amazon Comprehend",
    "a5": "",
    "as": "B"
  },
  {
    "id": 210,
    "q": "Which AWS service should a company use to organize, characterize, and search large numbers of images?",
    "a1": "A. Amazon Transcribe",
    "a2": "B. Amazon Rekognition",
    "a3": "C. Amazon Aurora",
    "a4": "D. Amazon QuickSight",
    "a5": "",
    "as": "B"
  },
  {
    "id": 211,
    "q": "An ecommerce company wants to use Amazon EC2 Auto Scaling to add and remove EC2 instances based on CPU utilization. Which AWS service or feature can initiate an Amazon EC2 Auto Scaling action to achieve this goal?",
    "a1": "A. Amazon Simple Queue Service (Amazon SQS)",
    "a2": "B. Amazon Simple Notification Service (Amazon SNS)",
    "a3": "C. AWS Systems Manager",
    "a4": "D. Amazon CloudWatch alarm",
    "a5": "",
    "as": "D"
  },
  {
    "id": 212,
    "q": "A company wants to host a private version control system for its application code in the AWS Cloud. Which AWS service should the company use to meet this requirement?",
    "a1": "A. AWS CodePipeline",
    "a2": "B. AWS CodeStar",
    "a3": "C. AWS CodeCommit",
    "a4": "D. AWS CodeDeploy",
    "a5": "",
    "as": "C"
  },
  {
    "id": 213,
    "q": "Which AWS service or tool can a company set up to send notifications that a custom spending threshold has been reached or exceeded?",
    "a1": "A. AWS Budgets",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. AWS CloudTrail",
    "a4": "D. AWS Support",
    "a5": "",
    "as": "A"
  },
  {
    "id": 214,
    "q": "Which AWS service is used to host static websites?",
    "a1": "A. Amazon S3",
    "a2": "B. Amazon Elastic Block Store (Amazon EBS)",
    "a3": "C. AWS CloudFormation",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "",
    "as": "A"
  },
  {
    "id": 215,
    "q": "Which AWS service contains built-in engines to protect web applications that run in the cloud from SQL injection attacks and cross-site scripting?",
    "a1": "A. AWS WAF",
    "a2": "B. AWS Shield Advanced",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. Amazon Detective",
    "a5": "",
    "as": "A"
  },
  {
    "id": 216,
    "q": "A company owns per-core software licenses. Which Amazon EC2 instance purchasing option must the company use for this license type?",
    "a1": "A. Reserved Instances",
    "a2": "B. Dedicated Hosts",
    "a3": "C. Spot Instances",
    "a4": "D. Dedicated Instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 217,
    "q": "A company needs to set up user authentication for a new application. Users must be able to sign in directly with a user name and password, or through a third- party provider. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS Single Sign-On",
    "a2": "B. AWS Signer",
    "a3": "C. Amazon Cognito",
    "a4": "D. AWS Directory Service",
    "a5": "",
    "as": "C"
  },
  {
    "id": 218,
    "q": "A company's IT team is managing MySQL database server clusters. The IT team has to patch the database and take backup snapshots of the data in the clusters. The company wants to move this workload to AWS so that these tasks will be completed automatically. What should the company do to meet these requirements?",
    "a1": "A. Deploy MySQL database server clusters on Amazon EC2 instances.",
    "a2": "B. Use Amazon RDS with a MySQL database.",
    "a3": "C. Use an AWS CloudFormation template to deploy MySQL database servers on Amazon EC2 instances.",
    "a4": "D. Migrate all the MySQL database data to Amazon S3.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 219,
    "q": "What is the primary use case for Amazon GuardDuty?",
    "a1": "A. Prevention of DDoS attacks",
    "a2": "B. Protection against SQL injection attacks",
    "a3": "C. Automatic monitoring for threats to AWS workloads",
    "a4": "D. Automatic provisioning of AWS resources",
    "a5": "",
    "as": "C"
  },
  {
    "id": 220,
    "q": "Which statements explain the business value of migration to the AWS Cloud? (Choose two.)",
    "a1": "A. The migration of enterprise applications to the AWS Cloud makes these applications automatically available on mobile devices.",
    "a2": "B. AWS availability and security provide the ability to improve service level agreements (SLAs) while reducing risk and unplanned downtime.",
    "a3": "C. Companies that migrate to the AWS Cloud eliminate the need to plan for high availability and disaster recovery.",
    "a4": "D. Companies that migrate to the AWS Cloud reduce IT costs related to infrastructure, freeing budget for reinvestment in other areas.",
    "a5": "E. Applications are modernized because migration to the AWS Cloud requires companies to rearchitect and rewrite all enterprise applications.",
    "as": "BD"
  },
  {
    "id": 221,
    "q": "A company needs to identify personally identifiable information (PII), such as credit card numbers, from data that is stored in Amazon S3. Which AWS service should the company use to meet this requirement?",
    "a1": "A. Amazon Inspector",
    "a2": "B. AWS Shield",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. Amazon Macie",
    "a5": "",
    "as": "D"
  },
  {
    "id": 222,
    "q": "Which AWS services or tools are designed to protect a workload from SQL injections, cross-site scripting, and DDoS attacks? (Choose two.)",
    "a1": "A. VPC endpoint",
    "a2": "B. Virtual private gateway",
    "a3": "C. AWS Shield Standard",
    "a4": "D. AWS Config",
    "a5": "E. AWS WAF",
    "as": "CE"
  },
  {
    "id": 223,
    "q": "A company wants to forecast future costs and usage of AWS resources based on past consumption. Which AWS service or tool will provide this forecast?",
    "a1": "A. AWS Cost and Usage Report",
    "a2": "B. Amazon Forecast",
    "a3": "C. AWS Pricing Calculator",
    "a4": "D. Cost Explorer",
    "a5": "",
    "as": "D"
  },
  {
    "id": 224,
    "q": "Which AWS services use cloud-native storage that provides replication across multiple Availability Zones by default? (Choose two.)",
    "a1": "A. Amazon ElastiCache",
    "a2": "B. Amazon RDS for Oracle",
    "a3": "C. Amazon Neptune",
    "a4": "D. Amazon DocumentDB (with MongoDB compatibility)",
    "a5": "E. Amazon Redshift",
    "as": "CD"
  },
  {
    "id": 225,
    "q": "Which AWS services are serverless? (Choose two.)",
    "a1": "A. AWS Fargate",
    "a2": "B. Amazon Managed Streaming for Apache Kafka",
    "a3": "C. Amazon EMR",
    "a4": "D. Amazon S3",
    "a5": "E. Amazon EC2",
    "as": "AD"
  },
  {
    "id": 226,
    "q": "Which task is the responsibility of AWS, according to the AWS shared responsibility model?",
    "a1": "A. Apply guest operating system patches to Amazon EC2 instances.",
    "a2": "B. Provide monitoring of human resources information management (HRIM) systems.",
    "a3": "C. Perform automated backups of Amazon RDS instances.",
    "a4": "D. Optimize the costs of running AWS services.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 227,
    "q": "A company needs to deploy a PostgreSQL database into Amazon RDS. The database must be highly available and fault tolerant. Which AWS solution should the company use to meet these requirements?",
    "a1": "A. Amazon RDS with a single Availability Zone",
    "a2": "B. Amazon RDS snapshots",
    "a3": "C. Amazon RDS with multiple Availability Zones",
    "a4": "D. AWS Database Migration Service (AWS DMS)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 228,
    "q": "A company wants to add facial identification to its user verification process on an application. Which AWS service should the company use to meet this requirement?",
    "a1": "A. Amazon Polly",
    "a2": "B. Amazon Transcribe",
    "a3": "C. Amazon Lex",
    "a4": "D. Amazon Rekognition",
    "a5": "",
    "as": "D"
  },
  {
    "id": 229,
    "q": "A company wants the ability to quickly upload its applications to the AWS Cloud without needing to provision underlying resources. Which AWS service will meet these requirements?",
    "a1": "A. AWS CloudFormation",
    "a2": "B. AWS Elastic Beanstalk",
    "a3": "C. AWS CodeDeploy",
    "a4": "D. AWS CodeCommit",
    "a5": "",
    "as": "B"
  },
  {
    "id": 230,
    "q": "Which AWS service monitors CPU utilization on Amazon EC2 instances?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. Amazon Inspector",
    "a3": "C. AWS Config",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "D"
  },
  {
    "id": 231,
    "q": "A company needs to label its AWS resources so that the company can categorize and track costs. What should the company do to meet this requirement?",
    "a1": "A. Use cost allocation tags.",
    "a2": "B. Use AWS Identity and Access Management (IAM).",
    "a3": "C. Use AWS Organizations.",
    "a4": "D. Use the AWS Cost Management coverage report.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 232,
    "q": "A company wants its employees to have access to virtual desktop infrastructure to securely access company-provided desktops through the employees' personal devices. Which AWS service should the company use to meet these requirements?",
    "a1": "A. Amazon AppStream 2.0",
    "a2": "B. AWS AppSync",
    "a3": "C. Amazon FSx for Windows File Server",
    "a4": "D. Amazon WorkSpaces",
    "a5": "",
    "as": "D"
  },
  {
    "id": 233,
    "q": "Which task can a company complete by using AWS Organizations?",
    "a1": "A. Track application deployment statuses globally.",
    "a2": "B. Remove unused and underutilized AWS resources across all accounts.",
    "a3": "C. Activate DDoS protection across all accounts.",
    "a4": "D. Share pre-purchased Amazon EC2 resources across accounts.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 234,
    "q": "A user has been granted permission to change their own IAM user password. Which AWS services can the user use to change the password? (Choose two.)",
    "a1": "A. AWS Command Line Interface (AWS CLI)",
    "a2": "B. AWS Key Management Service (AWS KMS)",
    "a3": "C. AWS Management Console",
    "a4": "D. AWS Resource Access Manager (AWS RAM)",
    "a5": "E. AWS Secrets Manager",
    "as": "AC"
  },
  {
    "id": 235,
    "q": "A company needs to run an application on Amazon EC2 instances. The instances cannot be interrupted at any time. The company needs an instance purchasing option that requires no long-term commitment or upfront payment. Which instance purchasing option will meet these requirements MOST cost-effectively?",
    "a1": "A. On-Demand Instances",
    "a2": "B. Spot Instances",
    "a3": "C. Dedicated Hosts",
    "a4": "D. Reserved Instances",
    "a5": "",
    "as": "A"
  },
  {
    "id": 236,
    "q": "A company uses Amazon EC2 instances to run its web application. The company uses On-Demand Instances and Spot Instances. The company needs to visualize its monthly spending on both types of instances. Which AWS service or feature will meet this requirement?",
    "a1": "A. AWS Cost Explorer",
    "a2": "B. AWS Budgets",
    "a3": "C. Amazon CloudWatch",
    "a4": "D. AWS Cost Categories",
    "a5": "",
    "as": "A"
  },
  {
    "id": 237,
    "q": "Which task can a user complete by using AWS Identity and Access Management (IAM)?",
    "a1": "A. Validate JSON syntax from an application configuration file.",
    "a2": "B. Analyze logs from an Amazon API Gateway call.",
    "a3": "C. Filter traffic to or from an Amazon EC2 instance.",
    "a4": "D. Grant permissions to applications that run on Amazon EC2 instances.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 238,
    "q": "A company needs to generate reports for business intelligence and operational analytics on petabytes of semistructured and structured data. These reports are produced from standard SQL queries on data that is in an Amazon S3 data lake. Which AWS service provides the ability to analyze this data?",
    "a1": "A. Amazon RDS",
    "a2": "B. Amazon Neptune",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon Redshift",
    "a5": "",
    "as": "D"
  },
  {
    "id": 239,
    "q": "A system automatically recovers from failure when a company launches its workload on the AWS Cloud services platform. Which pillar of the AWS Well-Architected Framework does this situation demonstrate?",
    "a1": "A. Cost optimization",
    "a2": "B. Operational excellence",
    "a3": "C. Performance efficiency",
    "a4": "D. Reliability",
    "a5": "",
    "as": "D"
  },
  {
    "id": 240,
    "q": "Which of the following describes AWS Local Zones?",
    "a1": "A. A cluster of data centers in one geographic location",
    "a2": "B. A site used by Amazon CloudFront to cache frequently accessed content",
    "a3": "C. An extension of an AWS Region to more granular locations",
    "a4": "D. One or more data centers with redundant power and networking",
    "a5": "",
    "as": "C"
  },
  {
    "id": 241,
    "q": "A retail company is migrating its IT infrastructure applications from on premises to the AWS Cloud. Which costs will the company eliminate with this migration? (Choose two.)",
    "a1": "A. Cost of data center operations",
    "a2": "B. Cost of application licensing",
    "a3": "C. Cost of marketing campaigns",
    "a4": "D. Cost of physical server hardware",
    "a5": "E. Cost of network management",
    "as": "AD"
  },
  {
    "id": 242,
    "q": "What is a benefit of moving to the AWS Cloud in terms of improving time to market?",
    "a1": "A. Decreased deployment speed",
    "a2": "B. Increased application security",
    "a3": "C. Increased business agility",
    "a4": "D. Increased backup capabilities",
    "a5": "",
    "as": "C"
  },
  {
    "id": 243,
    "q": "Which of the following are characteristics of a serverless application that runs in the AWS Cloud? (Choose two.)",
    "a1": "A. Users must manually configure Amazon EC2 instances.",
    "a2": "B. Users have a choice of operating systems.",
    "a3": "C. The application has built-in fault tolerance.",
    "a4": "D. Users can run Amazon EC2 Spot Instances.",
    "a5": "E. The application can scale based on demand.",
    "as": "CE"
  },
  {
    "id": 244,
    "q": "A company has existing software licenses that it wants to bring to AWS, but the licensing model requires licensing physical cores. How can the company meet this requirement in the AWS Cloud?",
    "a1": "A. Launch an Amazon EC2 instance with default tenancy.",
    "a2": "B. Launch an Amazon EC2 instance on a Dedicated Host.",
    "a3": "C. Create an On-Demand Capacity Reservation.",
    "a4": "D. Purchase Dedicated Reserved Instances.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 245,
    "q": "A company has a complex AWS architecture. The company needs assistance from a dedicated technical professional who can suggest strategies regarding incidents, trade-offs, support, and risk management. Which AWS Support plan will provide the required support?",
    "a1": "A. AWS Business Support",
    "a2": "B. AWS Enterprise Support",
    "a3": "C. AWS Developer Support",
    "a4": "D. AWS Basic Support",
    "a5": "",
    "as": "B"
  },
  {
    "id": 246,
    "q": "Which of the following is an advantage that the AWS Cloud provides to users?",
    "a1": "A. Users eliminate the need to guess about infrastructure capacity requirements.",
    "a2": "B. Users decrease their variable costs by maintaining sole ownership of IT hardware.",
    "a3": "C. Users maintain control of underlying IT infrastructure hardware.",
    "a4": "D. Users maintain control of operating systems for managed services.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 247,
    "q": "Which AWS services can use AWS WAF to protect against common web exploitations? (Choose two.)",
    "a1": "A. Amazon Route 53",
    "a2": "B. Amazon CloudFront",
    "a3": "C. AWS Transfer Family",
    "a4": "D. AWS Site-to-Site VPN",
    "a5": "E. Amazon API Gateway",
    "as": "BE"
  },
  {
    "id": 248,
    "q": "Which controls are shared under the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Awareness and training",
    "a2": "B. Patching of Amazon RDS",
    "a3": "C. Configuration management",
    "a4": "D. Physical and environmental controls",
    "a5": "E. Service and communications protection or security",
    "as": "AC"
  },
  {
    "id": 249,
    "q": "A company manages global applications that require static IP addresses. Which AWS service would enable the company to improve the availability and performance of its applications?",
    "a1": "A. Amazon CloudFront",
    "a2": "B. AWS Global Accelerator",
    "a3": "C. Amazon S3 Transfer Acceleration",
    "a4": "D. Amazon API Gateway",
    "a5": "",
    "as": "B"
  },
  {
    "id": 250,
    "q": "Which of the following are AWS compute services? (Choose two.)",
    "a1": "A. Amazon Lightsail",
    "a2": "B. AWS Systems Manager",
    "a3": "C. AWS CloudFormation",
    "a4": "D. AWS Batch",
    "a5": "E. Amazon Inspector",
    "as": "AD"
  },
  {
    "id": 251,
    "q": "A company needs to report on events that involve the specific AWS services that the company uses. Which AWS service or resource can the company use with Amazon CloudWatch to meet this requirement?",
    "a1": "A. Amazon Inspector",
    "a2": "B. AWS Personal Health Dashboard",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS CloudTrail logs",
    "a5": "",
    "as": "D"
  },
  {
    "id": 252,
    "q": "A company with AWS Enterprise Support needs help understanding its monthly AWS bill and wants to implement billing best practices. Which AWS tool or resource is available to accomplish these goals?",
    "a1": "A. Resource tagging",
    "a2": "B. AWS Concierge Support team",
    "a3": "C. AWS Abuse team",
    "a4": "D. AWS Support",
    "a5": "",
    "as": "B"
  },
  {
    "id": 253,
    "q": "Which of the following is an AWS key-value database offering consistent single-digit millisecond performance at any scale?",
    "a1": "A. Amazon RDS",
    "a2": "B. Amazon Aurora",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon Redshift",
    "a5": "",
    "as": "C"
  },
  {
    "id": 254,
    "q": "A company is developing a new Node.js application. The application must have a scalable NoSQL database to meet increasing demand as the popularity of the application grows. Which AWS service will meet the requirements for the database?",
    "a1": "A. Amazon Aurora Serverless",
    "a2": "B. Amazon ElastiCache",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon Redshift",
    "a5": "",
    "as": "C"
  },
  {
    "id": 255,
    "q": "A company wants to set up an entire development and continuous delivery toolchain for coding, building, testing, and deploying code. Which AWS service will meet these requirements?",
    "a1": "A. Amazon CodeGuru",
    "a2": "B. AWS CodeStar",
    "a3": "C. AWS CodeCommit",
    "a4": "D. AWS CodeDeploy",
    "a5": "",
    "as": "B"
  },
  {
    "id": 256,
    "q": "Which service enables customers to audit API calls in their AWS accounts?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. Amazon Inspector",
    "a4": "D. AWS X-Ray",
    "a5": "",
    "as": "A"
  },
  {
    "id": 257,
    "q": "A company is moving its office and must establish an encrypted connection to AWS. Which AWS service will help meet this requirement?",
    "a1": "A. AWS VPN",
    "a2": "B. Amazon Route 53",
    "a3": "C. Amazon API Gateway",
    "a4": "D. Amazon Connect",
    "a5": "",
    "as": "A"
  },
  {
    "id": 258,
    "q": "A company needs steady and predictable performance from its Amazon EC2 instances at the lowest possible cost. The company also needs the ability to scale resources to ensure that it has the right resources available at the right time. Which AWS service or resource will meet these requirements?",
    "a1": "A. Amazon CloudWatch",
    "a2": "B. Application Load Balancer",
    "a3": "C. AWS Batch",
    "a4": "D. Amazon EC2 Auto Scaling",
    "a5": "",
    "as": "D"
  },
  {
    "id": 259,
    "q": "Which action will provide documentation to help a company evaluate whether its use of the AWS Cloud is compliant with local regulatory standards?",
    "a1": "A. Running Amazon GuardDuty",
    "a2": "B. Using AWS Artifact",
    "a3": "C. Creating an AWS Support ticket",
    "a4": "D. Evaluating AWS CloudTrail logs",
    "a5": "",
    "as": "B"
  },
  {
    "id": 260,
    "q": "A company wants a cost-effective option when running its applications in an Amazon EC2 instance for short time periods. The applications can be interrupted. Which EC2 instance type will meet these requirements?",
    "a1": "A. Spot Instances",
    "a2": "B. On-Demand Instances",
    "a3": "C. Reserved Instances",
    "a4": "D. Dedicated Instances",
    "a5": "",
    "as": "A"
  },
  {
    "id": 261,
    "q": "A retail company is building a new mobile app. The company is evaluating whether to build the app at an on-premises data center or in the AWS Cloud. Which of the following are benefits of building this app in the AWS Cloud? (Choose two.)",
    "a1": "A. A large, upfront capital expense and low variable expenses",
    "a2": "B. Increased speed for trying out new projects",
    "a3": "C. Complete control over the physical security of the infrastructure",
    "a4": "D. Flexibility to scale up in minutes as the application becomes popular",
    "a5": "E. Ability to pick the specific data centers that will host the application servers",
    "as": "BD"
  },
  {
    "id": 262,
    "q": "A developer is working on enhancing applications at AWS. The developer needs a service that can securely host GitHub-based code, repositories, and version controls. Which AWS service should the developer use?",
    "a1": "A. AWS CodeStar",
    "a2": "B. Amazon CodeGuru",
    "a3": "C. AWS CodeCommit",
    "a4": "D. AWS CodePipeline",
    "a5": "",
    "as": "C"
  },
  {
    "id": 263,
    "q": "What is an AWS Region?",
    "a1": "A. A broad set of global, cloud-based products that include compute, storage, and databases",
    "a2": "B. A physical location around the world where data centers are clustered",
    "a3": "C. One or more discrete data centers with redundant power, networking, and connectivity",
    "a4": "D. A service that developers use to build applications that deliver latencies of single-digit milliseconds to users",
    "a5": "",
    "as": "B"
  },
  {
    "id": 264,
    "q": "Which AWS benefit enables users to deploy cloud infrastructure that consists of multiple geographic regions connected by a network with low latency, high throughput, and redundancy?",
    "a1": "A. Economies of scale",
    "a2": "B. Security",
    "a3": "C. Elasticity",
    "a4": "D. Global reach",
    "a5": "",
    "as": "D"
  },
  {
    "id": 265,
    "q": "A company is considering a migration from on premises to the AWS Cloud. The company's IT team needs to offload support of the workload. What should the IT team do to accomplish this goal?",
    "a1": "A. Use AWS Managed Services to provision, run, and support the company infrastructure.",
    "a2": "B. Build hardware refreshes into the operational calendar to ensure availability.",
    "a3": "C. Use Amazon Elastic Container Service (Amazon ECS) on Amazon EC2 instances.",
    "a4": "D. Overprovision compute capacity for seasonal events and traffic spikes to prevent downtime.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 266,
    "q": "What is a benefit of using AWS serverless computing?",
    "a1": "A. Application deployment and management are not required.",
    "a2": "B. Application security will be fully managed by AWS.",
    "a3": "C. Monitoring and logging are not needed.",
    "a4": "D. Management of infrastructure is offloaded to AWS.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 267,
    "q": "A company plans to launch an application that will run in multiple locations within the United States. The company needs to identify the two AWS Regions where the application can operate at the lowest price. Which AWS service or feature should the company use to determine the Regions that offer the lowest price?",
    "a1": "A. Cost Explorer",
    "a2": "B. AWS Budgets",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Pricing Calculator",
    "a5": "",
    "as": "D"
  },
  {
    "id": 268,
    "q": "Which approach will enhance a user's security on AWS?",
    "a1": "A. Use Multi-AZ deployments with Amazon RDS.",
    "a2": "B. Create a hybrid architecture by using AWS Direct Connect.",
    "a3": "C. Monitor application-specific information with AWS X-Ray.",
    "a4": "D. Encrypt data by using AWS Key Management Service (AWS KMS).",
    "a5": "",
    "as": "D"
  },
  {
    "id": 269,
    "q": "Which AWS service or tool is associated with an Amazon EC2 instance and acts as a virtual firewall to control inbound and outbound traffic?",
    "a1": "A. AWS WAF",
    "a2": "B. AWS Shield",
    "a3": "C. Network access control list (ACL)",
    "a4": "D. Security group",
    "a5": "",
    "as": "D"
  },
  {
    "id": 270,
    "q": "A company wants to migrate its on-premises Microsoft SQL Server database server to the AWS Cloud. The company has decided to use Amazon EC2 instances to run this database. Which of the following is the company responsible for managing, according to the AWS shared responsibility model?",
    "a1": "A. EC2 hypervisor",
    "a2": "B. Security patching of the guest operating system",
    "a3": "C. Network connectivity of the host server",
    "a4": "D. Uptime service level agreement (SLA) for the EC2 instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 271,
    "q": "A developer wants to deploy an application on a container-based service. The service must automatically provision and manage the backend instances. The service must provision only the necessary resources. Which AWS service will meet these requirements?",
    "a1": "A. Amazon EC2",
    "a2": "B. Amazon Lightsail",
    "a3": "C. Amazon Elastic Kubernetes Service (Amazon EKS)",
    "a4": "D. AWS Fargate",
    "a5": "",
    "as": "D"
  },
  {
    "id": 272,
    "q": "Which tasks require use of the AWS account root user? (Choose two.)",
    "a1": "A. Changing an AWS Support plan",
    "a2": "B. Modifying an Amazon EC2 instance type",
    "a3": "C. Grouping resources in AWS Systems Manager",
    "a4": "D. Running applications in Amazon Elastic Kubernetes Service (Amazon EKS)",
    "a5": "E. Closing an AWS account",
    "as": "AE"
  },
  {
    "id": 273,
    "q": "Which AWS service enables the decoupling and scaling of applications?",
    "a1": "A. Amazon Simple Queue Service (Amazon SQS)",
    "a2": "B. AWS Outposts",
    "a3": "C. Amazon S3",
    "a4": "D. Amazon Simple Email Service (Amazon SES)",
    "a5": "",
    "as": "A"
  },
  {
    "id": 274,
    "q": "Which of the following describes some of the core functionality of Amazon S3?",
    "a1": "A. Amazon S3 is a high-performance block storage service that is designed for use with Amazon EC2.",
    "a2": "B. Amazon S3 is an object storage service that provides high-level performance, security, scalability, and data availability.",
    "a3": "C. Amazon S3 is a fully managed, highly reliable, and scalable file storage system that is accessible over the industry-standard SMB protocol.",
    "a4": "D. Amazon S3 is a scalable, fully managed elastic NFS for use with AWS Cloud services and on-premises resources.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 275,
    "q": "How does consolidated billing help reduce costs for a company that has multiple AWS accounts?",
    "a1": "A. It aggregates usage across accounts so that the company can reach volume discount thresholds sooner.",
    "a2": "B. It offers an additional 5% discount on purchases of All Upfront Reserved Instances.",
    "a3": "C. It provides a simplified billing invoice that the company can process more quickly than a standard invoice.",
    "a4": "D. It gives AWS resellers the ability to bill their customers for usage.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 276,
    "q": "A company wants to secure its consumer web application by using SSL/TLS to encrypt traffic. Which AWS service can the company use to meet this goal?",
    "a1": "A. AWS WAF",
    "a2": "B. AWS Shield",
    "a3": "C. Amazon VPC",
    "a4": "D. AWS Certificate Manager (ACM)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 277,
    "q": "Which of the following are advantages of moving to the AWS Cloud? (Choose two.)",
    "a1": "A. Users can implement all AWS services in seconds.",
    "a2": "B. AWS assumes all responsibility for the security of infrastructure and applications.",
    "a3": "C. Users experience increased speed and agility.",
    "a4": "D. Users benefit from massive economies of scale.",
    "a5": "E. Users can move hardware from their data center to the AWS Cloud.",
    "as": "CD"
  },
  {
    "id": 278,
    "q": "A company stores configuration files in an Amazon S3 bucket. These configuration files must be accessed by applications that are running on Amazon EC2 instances. According to AWS security best practices, how should the company grant permissions to allow the applications for access the S3 bucket?",
    "a1": "A. Use the AWS account root user access keys.",
    "a2": "B. Use the AWS access key ID and the EC2 secret access key.",
    "a3": "C. Use an IAM role with the necessary permissions.",
    "a4": "D. Activate multi-factor authentication (MFA) and versioning on the S3 bucket.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 279,
    "q": "A company needs an AWS service that will continuously monitor the company's AWS account for suspicious activity. The service must have the ability to initiate automated actions against threats that are identified in the security findings. Which service will meet these requirements?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. Amazon Detective",
    "a3": "C. Amazon Inspector",
    "a4": "D. Amazon GuardDuty",
    "a5": "",
    "as": "D"
  },
  {
    "id": 280,
    "q": "A company wants to analyze streaming user data and respond to customer queries in real time. Which AWS service can meet these requirements?",
    "a1": "A. Amazon QuickSight",
    "a2": "B. Amazon Redshift",
    "a3": "C. Amazon Kinesis Data Analytics",
    "a4": "D. AWS Data Pipeline",
    "a5": "",
    "as": "C"
  },
  {
    "id": 281,
    "q": "Who can create and manage access keys for an AWS account root user?",
    "a1": "A. The AWS account owner",
    "a2": "B. An IAM user that has administrator permissions",
    "a3": "C. IAM users within a designated group",
    "a4": "D. An IAM user that has the required role",
    "a5": "",
    "as": "A"
  },
  {
    "id": 282,
    "q": "Which AWS service can help a company detect an outage of its website servers and redirect users to alternate servers?",
    "a1": "A. Amazon CloudFront",
    "a2": "B. Amazon GuardDuty",
    "a3": "C. Amazon Route 53",
    "a4": "D. AWS Trusted Advisor",
    "a5": "",
    "as": "C"
  },
  {
    "id": 283,
    "q": "A web application is hosted on AWS using an Elastic Load Balancer, multiple Amazon EC2 instances, and Amazon RDS. Which security measures fall under the responsibility of AWS? (Choose two.)",
    "a1": "A. Running a virus scan on EC2 instances",
    "a2": "B. Protecting against IP spoofing and packet sniffing",
    "a3": "C. Installing the latest security patches on the RDS instance",
    "a4": "D. Encrypting communication between the EC2 instances and the Elastic Load Balancer",
    "a5": "E. Configuring a security group and a network access control list (NACL) for EC2 instances",
    "as": "BC"
  },
  {
    "id": 284,
    "q": "Which of the following is an AWS Well-Architected Framework design principle for operational excellence in the AWS Cloud?",
    "a1": "A. Go global in minutes.",
    "a2": "B. Make frequent, small, reversible changes.",
    "a3": "C. Implement a strong foundation of identity and access management.",
    "a4": "D. Stop spending money on hardware infrastructure for data center operations.",
    "a5": "",
    "as": "B"
  },
  {
    "id": 285,
    "q": "Which AWS service provides intelligent recommendations to improve code quality and identify an application's most expensive lines of code?",
    "a1": "A. Amazon CodeGuru",
    "a2": "B. AWS CodeStar",
    "a3": "C. AWS CodeCommit",
    "a4": "D. AWS CodeDeploy",
    "a5": "",
    "as": "A"
  },
  {
    "id": 286,
    "q": "A company wants to expand from one AWS Region into a second AWS Region. What does the company need to do to expand into the second Region?",
    "a1": "A. Contact an AWS account manager to sign a new contract.",
    "a2": "B. Move an Availability Zone to the second Region.",
    "a3": "C. Begin to deploy resources in the second Region.",
    "a4": "D. Download the AWS Management Console for the second Region.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 287,
    "q": "Which AWS service provides storage that can be mounted across multiple Amazon EC2 instances?",
    "a1": "A. Amazon WorkSpaces",
    "a2": "B. Amazon Elastic File System (Amazon EFS)",
    "a3": "C. AWS Database Migration Service (AWS DMS)",
    "a4": "D. AWS Snowball Edge",
    "a5": "",
    "as": "B"
  },
  {
    "id": 288,
    "q": "A company needs to deploy applications in the AWS Cloud as quickly as possible. The company also needs to minimize the complexity that is related to the management of AWS resources. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS Config",
    "a2": "B. AWS Elastic Beanstalk",
    "a3": "C. Amazon EC2",
    "a4": "D. Amazon Personalize",
    "a5": "",
    "as": "B"
  },
  {
    "id": 289,
    "q": "A company has a set of databases that are stored on premises. The company wants to bring its existing Microsoft SQL Server licenses when the company moves the databases to run on Amazon EC2 instances. Which EC2 instance purchasing option should the company use to meet these requirements?",
    "a1": "A. Dedicated Instances",
    "a2": "B. Reserved Instances",
    "a3": "C. Dedicated Hosts",
    "a4": "D. Spot Instances",
    "a5": "",
    "as": "C"
  },
  {
    "id": 290,
    "q": "Which of the following is a way to use Amazon EC2 Auto Scaling groups to scale capacity in the AWS Cloud?",
    "a1": "A. Scale the number of EC2 instances in or out automatically, based on demand.",
    "a2": "B. Use serverless EC2 instances.",
    "a3": "C. Scale the size of EC2 instances up or down automatically, based on demand.",
    "a4": "D. Transfer unused CPU resources between EC2 instances.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 291,
    "q": "A company discovered unauthorized access to resources in its on-premises data center. Upon investigation, the company found that the requests originated from a resource hosted on AWS. Which AWS team should the company contact to report this issue?",
    "a1": "A. AWS Customer Service team",
    "a2": "B. AWS Sales team",
    "a3": "C. AWS Abuse team",
    "a4": "D. AWS Technical Support team",
    "a5": "",
    "as": "C"
  },
  {
    "id": 292,
    "q": "Which of the following are aspects of the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Configuration management of infrastructure devices is the customer's responsibility.",
    "a2": "B. For Amazon S3, AWS operates the infrastructure layer, the operating systems, and the platforms.",
    "a3": "C. AWS is responsible for protecting the physical cloud infrastructure.",
    "a4": "D. AWS is responsible for training the customer's employees on AWS products and services.",
    "a5": "E. For Amazon EC2, AWS is responsible for maintaining the guest operating system.",
    "as": "BC"
  },
  {
    "id": 293,
    "q": "A company needs real-time guidance to follow AWS best practices to save money, improve system performance, and close security gaps. Which AWS service should the company use?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. AWS Management Console",
    "a4": "D. AWS Systems Manager",
    "a5": "",
    "as": "B"
  },
  {
    "id": 294,
    "q": "A company wants to organize its users so that the company can grant permissions to the users as a group. Which AWS service or tool can the company use to meet this requirement?",
    "a1": "A. Security groups",
    "a2": "B. AWS Identity and Access Management (IAM)",
    "a3": "C. Resource groups",
    "a4": "D. AWS Security Hub",
    "a5": "",
    "as": "B"
  },
  {
    "id": 295,
    "q": "A company runs applications that process credit card information. Auditors have asked if the AWS environment has changed since the previous audit. If the AWS environment has changed, the auditors want to know how it has changed. Which AWS services can provide this information? (Choose two.)",
    "a1": "A. AWS Artifact",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. AWS Config",
    "a4": "D. AWS CloudTrail",
    "a5": "E. AWS Identity and Access Management (IAM)",
    "as": "CD"
  },
  {
    "id": 296,
    "q": "A company wants to use a template to reliably provision, manage, and update its infrastructure in the AWS Cloud. Which AWS service will meet these requirements?",
    "a1": "A. AWS Lambda",
    "a2": "B. AWS CloudFormation",
    "a3": "C. AWS Fargate",
    "a4": "D. AWS CodeDeploy",
    "a5": "",
    "as": "B"
  },
  {
    "id": 297,
    "q": "A company is reviewing the current costs of running its own infrastructure on premises. The company wants to compare these on-premises costs to the costs of running infrastructure in the AWS Cloud. How should the company make this comparison?",
    "a1": "A. Review the AWS shared responsibility model.",
    "a2": "B. Audit existing software and hardware licensing costs.",
    "a3": "C. Analyze the AWS Well-Architected Framework.",
    "a4": "D. Use Migration Evaluator.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 298,
    "q": "A company needs a low-code, visual workflow service that developers can use to build distributed applications. Which AWS service is designed to meet these requirements?",
    "a1": "A. AWS Step Functions",
    "a2": "B. AWS Config",
    "a3": "C. AWS Lambda",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "A"
  },
  {
    "id": 299,
    "q": "A company wants to accelerate migration from its data center to the AWS Cloud. Which combination of AWS services should the company use to meet this requirement? (Choose two.)",
    "a1": "A. Amazon Connect",
    "a2": "B. AWS Direct Connect",
    "a3": "C. AWS Server Migration Service (AWS SMS)",
    "a4": "D. Amazon Route 53",
    "a5": "E. AWS Organizations",
    "as": "BC"
  },
  {
    "id": 300,
    "q": "What should a user do if the user loses an IAM secret access key?",
    "a1": "A. Retrieve the secret access key by using the IAM console.",
    "a2": "B. Create a new user with a new access key and a new secret access key.",
    "a3": "C. Rotate the secret access key.",
    "a4": "D. Request a new secret access key from AWS Support.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 301,
    "q": "A company wants to deploy a Docker application to the AWS Cloud. However, the company does not want to manage the underlying servers. Which combination of AWS services should the company use to meet these requirements? (Choose two.)",
    "a1": "A. Amazon EC2",
    "a2": "B. Amazon EC2 Auto Scaling",
    "a3": "C. AWS Elastic Beanstalk",
    "a4": "D. Amazon CloudFront",
    "a5": "E. AWS Fargate",
    "as": "CE"
  },
  {
    "id": 302,
    "q": "A company needs to transfer 60 TB of data to the AWS Cloud in a secure manner. Which of the following should the company use to meet these requirements?",
    "a1": "A. AWS Snowball Edge device",
    "a2": "B. Amazon Elastic Block Store (Amazon EBS)",
    "a3": "C. Amazon Elastic File System (Amazon EFS)",
    "a4": "D. Amazon S3",
    "a5": "",
    "as": "A"
  },
  {
    "id": 303,
    "q": "A gaming company wants to move its on-premises environment to AWS. The company needs its resources to be highly available. Which benefit does the AWS Cloud provide to meet this requirement?",
    "a1": "A. Reliability",
    "a2": "B. The AWS shared responsibility model",
    "a3": "C. Security",
    "a4": "D. Agility",
    "a5": "",
    "as": "A"
  },
  {
    "id": 304,
    "q": "An ecommerce company has been monitoring usage of its online store that is hosted on a fleet of Amazon EC2 instances. Surges in traffic occur every weekend day at the same time and last for approximately 4 hours. Which AWS service should the company use to ensure that there are enough instances to meet the surges in demand?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon EventBridge (Amazon CloudWatch Events)",
    "a3": "C. Elastic Load Balancing (ELB)",
    "a4": "D. Amazon EC2 Auto Scaling",
    "a5": "",
    "as": "D"
  },
  {
    "id": 305,
    "q": "A company needs stateless network filtering for its VPC. Which AWS service, tool, or feature will meet this requirement?",
    "a1": "A. AWS PrivateLink",
    "a2": "B. Security group",
    "a3": "C. Network access control list (ACL)",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "C"
  },
  {
    "id": 306,
    "q": "A company needs to audit its AWS resources. The company must document any changes that have been made to the resources. Which AWS service will meet these requirements?",
    "a1": "A. AWS Artifact",
    "a2": "B. AWS Config",
    "a3": "C. Amazon Inspector",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "B"
  },
  {
    "id": 307,
    "q": "A company needs fully managed, highly reliable, and scalable file storage that is accessible over the Server Message Block (SMB) protocol. Which AWS service will meet these requirements?",
    "a1": "A. Amazon S3",
    "a2": "B. Amazon Elastic File System (Amazon EFS)",
    "a3": "C. Amazon FSx for Windows File Server",
    "a4": "D. Amazon Elastic Block Store (Amazon EBS)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 308,
    "q": "Which AWS service should a company use to create a NoSQL database?",
    "a1": "A. Amazon Aurora",
    "a2": "B. Amazon DynamoDB",
    "a3": "C. Amazon Redshift",
    "a4": "D. Amazon Neptune",
    "a5": "",
    "as": "B"
  },
  {
    "id": 309,
    "q": "A company is migrating to the AWS Cloud. The company requires consultative review and guidance for its applications during the migration. After the migration is complete, the company requires a response within 30 minutes if business-critical systems go down. Which AWS Support plans meet these requirements? (Choose two.)",
    "a1": "A. AWS Enterprise Support",
    "a2": "B. AWS Enterprise On-Ramp Support",
    "a3": "C. AWS Developer Support",
    "a4": "D. AWS Basic Support",
    "a5": "E. AWS Business Support",
    "as": "AB"
  },
  {
    "id": 310,
    "q": "A company needs an AWS Support plan that provides programmatic case management through the AWS Support API. Which support plan will meet this requirement MOST cost-effectively?",
    "a1": "A. AWS Business Support",
    "a2": "B. AWS Basic Support",
    "a3": "C. AWS Developer Support",
    "a4": "D. AWS Enterprise Support",
    "a5": "",
    "as": "A"
  },
  {
    "id": 311,
    "q": "A company that operates in the AWS Cloud wants to test workloads and team responses to simulated events. The company will conduct an exercise to identify potential issues that need to be addressed. Which design principle of the AWS Well-Architected Framework does this exercise represent?",
    "a1": "A. Anticipate failure.",
    "a2": "B. Automatically recover from failure.",
    "a3": "C. Measure overall cost efficiency.",
    "a4": "D. Implement loosely coupled dependencies.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 312,
    "q": "Which AWS services provide high availability across multiple Availability Zones by default? (Choose two.)",
    "a1": "A. Amazon EC2",
    "a2": "B. Amazon Elastic Block Store (Amazon EBS)",
    "a3": "C. Amazon Elastic File System (Amazon EFS)",
    "a4": "D. Amazon Redshift",
    "a5": "E. Amazon S3",
    "as": "CE"
  },
  {
    "id": 313,
    "q": "A company needs to perform queries and interactively search and analyze log data. Which AWS service or feature will meet this requirement?",
    "a1": "A. Amazon EventBridge (Amazon CloudWatch Events)",
    "a2": "B. Amazon CloudWatch anomaly detection",
    "a3": "C. Amazon CloudWatch Logs Insights",
    "a4": "D. Amazon CloudWatch Logs streams",
    "a5": "",
    "as": "C"
  },
  {
    "id": 314,
    "q": "A company has an on-premises Oracle database. The company spends a significant amount of time on database administration activities. The company is moving the database to AWS and needs to minimize the time that is required for those administration activities. Which AWS service should the company use to meet this requirement?",
    "a1": "A. Amazon ElastiCache",
    "a2": "B. Amazon EC2",
    "a3": "C. Amazon RDS",
    "a4": "D. Amazon DynamoDB",
    "a5": "",
    "as": "C"
  },
  {
    "id": 315,
    "q": "A company is running an Amazon EC2 instance in a VPC. Which of the following can the company use to route and filter incoming network requests for the EC2 instance?",
    "a1": "A. Route tables and web application firewalls",
    "a2": "B. Security groups and route tables",
    "a3": "C. Security groups and a network intrusion system",
    "a4": "D. Route tables and AWS Shield",
    "a5": "",
    "as": "B"
  },
  {
    "id": 316,
    "q": "A company plans to migrate its custom marketing application and order-processing application to AWS. The company needs to deploy the applications on different types of instances with various configurations of CPU, memory, storage, and networking capacity. Which AWS service should the company use to meet these requirements?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon Cognito",
    "a3": "C. Amazon Athena",
    "a4": "D. Amazon EC2",
    "a5": "",
    "as": "D"
  },
  {
    "id": 317,
    "q": "A company wants to set up a Domain Name System (DNS) record for its application with a failover routing policy that is based on health checks. Which AWS service or resource should the company use to achieve this goal?",
    "a1": "A. Amazon Connect",
    "a2": "B. Application Load Balancer",
    "a3": "C. Amazon Route 53",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "C"
  },
  {
    "id": 318,
    "q": "Which of the following are AWS best practice recommendations for the use of AWS Identity and Access Management (IAM)? (Choose two.)",
    "a1": "A. Use the AWS account root user tor daily access.",
    "a2": "B. Use access keys and secret access keys on Amazon EC2.",
    "a3": "C. Rotate credentials on a regular basis.",
    "a4": "D. Create a shared set of access keys for system administrators.",
    "a5": "E. Configure multi-factor authentication (MFA).",
    "as": "CE"
  },
  {
    "id": 319,
    "q": "A company needs to store code in a version control system. The company also needs to continually deploy updated code through a series of automated steps (build, test, package, and deploy). Which combination of AWS services will meet these requirements? (Choose two.)",
    "a1": "A. AWS CloudFormation",
    "a2": "B. AWS CodeCommit",
    "a3": "C. AWS Control Tower",
    "a4": "D. AWS Elastic Beanstalk",
    "a5": "E. AWS CodePipoline",
    "as": "BE"
  },
  {
    "id": 320,
    "q": "An ecommerce company has deployed a new web application on Amazon EC2 instances. The company wants to distribute incoming HTTP traffic evenly across all running instances.Which AWS service or resource will meet this requirement?",
    "a1": "A. Amazon EC2 Auto Scaling",
    "a2": "B. Application Load Balancer",
    "a3": "C. Gateway Load Balancer",
    "a4": "D. Network Load Balancer",
    "a5": "",
    "as": "B"
  },
  {
    "id": 321,
    "q": "Which of the following are advantages of moving from on premises to the AWS Cloud? (Choose two.)",
    "a1": "A. Trade variable expenses for capital expenses.",
    "a2": "B. Eliminate costs related to running and maintaining data centers.",
    "a3": "C. Benefit from massive economies of scale.",
    "a4": "D. Eliminate the need to tram IT staff.",
    "a5": "E. Gam the ability to reserve capacity for 7 years or more.",
    "as": "BC"
  },
  {
    "id": 322,
    "q": "A company is using an Amazon RDS database to run reports that are input/output (I/O) intensive. Which AWS service can be used to improve the database performance?",
    "a1": "A. Amazon DynamoDB Accelerator (DAX)",
    "a2": "B. Amazon EMR",
    "a3": "C. Amazon ElastiCache",
    "a4": "D. Amazon Redshift",
    "a5": "",
    "as": "C"
  },
  {
    "id": 323,
    "q": "Which AWS service provides automated backups of data by default?",
    "a1": "A. Amazon S3",
    "a2": "B. Amazon Aurora",
    "a3": "C. Amazon ElastiCache for Memcached",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "",
    "as": "B"
  },
  {
    "id": 324,
    "q": "Which AWS service is a fully hosted version control service?",
    "a1": "A. AWS CodeCommit",
    "a2": "B. AWS CodeBuild",
    "a3": "C. AWS CodeDeploy",
    "a4": "D. AWS CodeStar",
    "a5": "",
    "as": "A"
  },
  {
    "id": 325,
    "q": "A company is using Amazon RDS. Which task is the company's responsibility, according to the AWS shared responsibility model?",
    "a1": "A. Apply encryption options for the database.",
    "a2": "B. Manage the underlying server hardware on which Amazon RDS runs.",
    "a3": "C. Apply patches to the underlying operating system.",
    "a4": "D. Apply minor patches to the database.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 326,
    "q": "A company recently created its first AWS account. Which AWS services will require the use of a VPC? (Choose two.)",
    "a1": "A. Amazon S3",
    "a2": "B. Amazon Elastic File System (Amazon EFS)",
    "a3": "C. Amazon Cognito",
    "a4": "D. Amazon DynamoDB",
    "a5": "E. Amazon EC2",
    "as": "BE"
  },
  {
    "id": 327,
    "q": "A user has an AWS account with a Business-level AWS Support plan and needs assistance with handling a production service disruption. Which action should the user take?",
    "a1": "A. Contact the dedicated AWS technical account manager (TAM).",
    "a2": "B. Contact the dedicated AWS Concierge Support team.",
    "a3": "C. Open a business-critical system down support case.",
    "a4": "D. Open a production system down support case.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 328,
    "q": "A company is using Amazon EC2 instances. Which tasks are the company's responsibility, according to the AWS shared responsibility model? (Choose two.)",
    "a1": "A. Maintain the network infrastructure.",
    "a2": "B. Patch the guest operating system.",
    "a3": "C. Configure a security group on deployed EC2 instances.",
    "a4": "D. Provide physical security for the underlying hardware of the EC2 instances.",
    "a5": "E. Manage the underlying hypervisor.",
    "as": "BC"
  },
  {
    "id": 329,
    "q": "Which of the following does Amazon CloudFront use to distribute content to users around the world?",
    "a1": "A. Amazon VPC",
    "a2": "B. AWS Local Zones",
    "a3": "C. Edge locations",
    "a4": "D. Availability Zones",
    "a5": "",
    "as": "C"
  },
  {
    "id": 330,
    "q": "Which pillar of the AWS Well-Architected Framework includes the continual improvement of processes and procedures as a priority?",
    "a1": "A. Cost optimization",
    "a2": "B. Reliability",
    "a3": "C. Performance efficiency",
    "a4": "D. Operational excellence",
    "a5": "",
    "as": "D"
  },
  {
    "id": 331,
    "q": "Which of the following consists of one or more isolated data centers in the same regional area that are interconnected through low-latency networks?",
    "a1": "A. Availability Zone",
    "a2": "B. Edge location",
    "a3": "C. AWS Region",
    "a4": "D. Private networking",
    "a5": "",
    "as": "A"
  },
  {
    "id": 332,
    "q": "Which AWS service or resource helps on-premises applications connect to AWS Cloud-based storage and caches the data locally for low-latency access?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. AWS Storage Gateway",
    "a3": "C. Amazon S3",
    "a4": "D. AWS Snowball Edge",
    "a5": "",
    "as": "B"
  },
  {
    "id": 333,
    "q": "Which AWS service or feature enables users to get one bill and easily track charges for multiple AWS accounts?",
    "a1": "A. AWS Organizations",
    "a2": "B. Cost Explorer",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Management Console",
    "a5": "",
    "as": "A"
  },
  {
    "id": 334,
    "q": "A company has a global website with static content. Which AWS service will deliver the static content with low latency?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon CloudFront",
    "a3": "C. Amazon EC2 Auto Scaling",
    "a4": "D. AWS Compute Optimizer",
    "a5": "",
    "as": "B"
  },
  {
    "id": 335,
    "q": "Which AWS service provides alerts when an AWS event may impact a company's AWS resources?",
    "a1": "A. AWS Personal Health Dashboard",
    "a2": "B. AWS Service Health Dashboard",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Infrastructure Event Management",
    "a5": "",
    "as": "A"
  },
  {
    "id": 336,
    "q": "A company manages an on-premises MySQL database on a Windows server. The company wants to migrate the database to AWS and needs a solution that will reduce the administrative overhead of the database. Which AWS service will meet this requirement?",
    "a1": "A. Amazon Redshift",
    "a2": "B. Amazon ElastiCache",
    "a3": "C. Amazon RDS",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "",
    "as": "C"
  },
  {
    "id": 337,
    "q": "Which AWS service can be used to provide an on-demand, cloud-based contact center?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. Amazon Connect",
    "a3": "C. AWS Support Center",
    "a4": "D. AWS Managed Services",
    "a5": "",
    "as": "B"
  },
  {
    "id": 338,
    "q": "Which benefit of cloud computing gives a company the ability to deploy applications to users all over the world through a network of AWS Regions, Availability Zones, and edge locations?",
    "a1": "A. Economy of scale",
    "a2": "B. Global reach",
    "a3": "C. Agility",
    "a4": "D. High availability",
    "a5": "",
    "as": "B"
  },
  {
    "id": 339,
    "q": "Which AWS service is a relational database compatible with MySQL and PostgreSQL?",
    "a1": "A. Amazon Redshift",
    "a2": "B. Amazon DynamoDB",
    "a3": "C. Amazon Aurora",
    "a4": "D. Amazon Neptune",
    "a5": "",
    "as": "C"
  },
  {
    "id": 340,
    "q": "A company uses a database that has a simple sign-up page to create users, and a basic login form to authenticate users so they can access the database. The company wants to give users the ability to store personal information, but user access must be controlled in a more secure and reliable way. Which AWS service or feature will meet these requirements?",
    "a1": "A. Security groups",
    "a2": "B. Amazon GuardDuty",
    "a3": "C. AWS Secrets Manager",
    "a4": "D. Amazon Cognito",
    "a5": "",
    "as": "D"
  },
  {
    "id": 341,
    "q": "A company is running multiple workloads in the AWS Cloud and recently began investigating ways to reduce costs. The company is already running fault-tolerant workloads on Amazon EC2 that perform periodic checkpoints in case of an outage. Which AWS service or pricing model can provide the GREATEST cost savings?",
    "a1": "A. Capacity Reservations",
    "a2": "B. Amazon Lightsail",
    "a3": "C. Spot Instances",
    "a4": "D. Dedicated Hosts",
    "a5": "",
    "as": "C"
  },
  {
    "id": 342,
    "q": "A company is undergoing a security audit. The audit includes security validation and compliance validation of the AWS infrastructure and services that the company uses. The auditor needs to locate compliance-related information and must download AWS security and compliance documents. These documents include the System and Organization Control (SOC) reports. Which AWS service or group can provide these documents?",
    "a1": "A. AWS Abuse team",
    "a2": "B. AWS Artifact",
    "a3": "C. AWS Support",
    "a4": "D. AWS Config",
    "a5": "",
    "as": "B"
  },
  {
    "id": 343,
    "q": "Which of the following are design principles of the reliability pillar of the AWS Well-Architected Framework? (Choose two.)",
    "a1": "A. Perform operations as code.",
    "a2": "B. Stop guessing capacity.",
    "a3": "C. Adopt serverless architecture whenever possible.",
    "a4": "D. Use build and deployment management systems.",
    "a5": "E. Make changes to infrastructure by using automation.",
    "as": "BE"
  },
  {
    "id": 344,
    "q": "A company needs to perform data processing once a week that typically takes about 5 hours to complete. Which AWS service should the company use for this workload?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon EC2",
    "a3": "C. AWS CodeDeploy",
    "a4": "D. AWS Wavelength",
    "a5": "",
    "as": "B"
  },
  {
    "id": 345,
    "q": "A company is developing a new web application. The company must give users the ability to log in to the application through social identity providers. Which AWS service will meet these requirements?",
    "a1": "A. AWS Directory Service",
    "a2": "B. Amazon Cognito",
    "a3": "C. AWS Identity and Access Management (IAM)",
    "a4": "D. AWS Single Sign-On",
    "a5": "",
    "as": "B"
  },
  {
    "id": 346,
    "q": "According to the AWS shared responsibility model, which activities are the customer's responsibility for security in the AWS Cloud? (Choose two.)",
    "a1": "A. Hardware maintenance",
    "a2": "B. Amazon EC2 operating system patching",
    "a3": "C. API access control for AWS resources",
    "a4": "D. Configuration management of infrastructure devices",
    "a5": "E. Maintenance of an Availability Zone",
    "as": "BC"
  },
  {
    "id": 347,
    "q": "Which service is an AWS in-memory data store service?",
    "a1": "A. Amazon Aurora",
    "a2": "B. Amazon RDS",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon ElastiCache",
    "a5": "",
    "as": "D"
  },
  {
    "id": 348,
    "q": "Which duty is a responsibility of AWS under the AWS shared responsibility model?",
    "a1": "A. Identity and access management",
    "a2": "B. Server-side encryption (SSE)",
    "a3": "C. Firewall configuration",
    "a4": "D. Maintaining physical hardware",
    "a5": "",
    "as": "D"
  },
  {
    "id": 349,
    "q": "Which guidelines are key AWS architectural design principles? (Choose two.)",
    "a1": "A. Design for fixed resources.",
    "a2": "B. Build scalable architectures.",
    "a3": "C. Use tightly coupled components.",
    "a4": "D. Use managed services when possible.",
    "a5": "E. Design for human interaction.",
    "as": "BD"
  },
  {
    "id": 350,
    "q": "A company is planning to build a workload in the AWS Cloud. The company needs to estimate the costs of the network, compute, storage, and database for the workload. Which AWS service or tool should the company use to generate this estimate?",
    "a1": "A. AWS Budgets",
    "a2": "B. AWS Organizations",
    "a3": "C. Cost Explorer",
    "a4": "D. AWS Pricing Calculator",
    "a5": "",
    "as": "D"
  },
  {
    "id": 351,
    "q": "A user is a new AWS account owner who has no special access requirements. What should this user do with the AWS account root user access keys?",
    "a1": "A. Share the keys with all relevant internal users so that those users can programmatically access AWS services.",
    "a2": "B. Post the keys on GitHub to provide development teams with access to AWS services.",
    "a3": "C. Use the keys for access, but do not share the keys with anyone.",
    "a4": "D. Delete the keys and create IAM users.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 352,
    "q": "Which AWS service allows for file sharing between multiple Amazon EC2 instances?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. AWS Snowball Edge",
    "a3": "C. AWS Backup",
    "a4": "D. Amazon Elastic File System (Amazon EFS)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 353,
    "q": "A company is running and managing its own Docker environment on Amazon EC2 instances. The company wants an alternative to help manage cluster size, scheduling, and environment maintenance. Which AWS service meets these requirements?",
    "a1": "A. AWS Lambda",
    "a2": "B. Amazon RDS",
    "a3": "C. AWS Fargate",
    "a4": "D. Amazon Athena",
    "a5": "",
    "as": "C"
  },
  {
    "id": 354,
    "q": "Which databases are available on Amazon RDS? (Choose two.)",
    "a1": "A. Sybase",
    "a2": "B. Microsoft SQL Server",
    "a3": "C. IBM Db2",
    "a4": "D. MongoDB",
    "a5": "E. PostgreSQL",
    "as": "BE"
  },
  {
    "id": 355,
    "q": "Which Amazon S3 feature or storage class uses the AWS backbone network and edge locations to reduce latencies from the end user to Amazon S3?",
    "a1": "A. S3 Cross-Region Replication",
    "a2": "B. S3 Transfer Acceleration",
    "a3": "C. S3 Event Notifications",
    "a4": "D. S3 Standard-Infrequent Access (S3 Standard-IA)",
    "a5": "",
    "as": "B"
  },
  {
    "id": 356,
    "q": "Which design principles of the AWS Well-Architected Framework help increase reliability? (Choose two.)",
    "a1": "A. Automatically recover from failure.",
    "a2": "B. Enable traceability.",
    "a3": "C. Scale horizontally to increase workload availability.",
    "a4": "D. Automate security best practices.",
    "a5": "E. Keep people away from data.",
    "as": "AC"
  },
  {
    "id": 357,
    "q": "Management at a large company wants to avoid long-term contracts and is interested in AWS to move from fixed costs to variable costs. What is the value proposition of AWS for this company?",
    "a1": "A. Economy of scale",
    "a2": "B. Pay-as-you-go pricing",
    "a3": "C. Volume discounts",
    "a4": "D. Cost optimization",
    "a5": "",
    "as": "B"
  },
  {
    "id": 358,
    "q": "Which AWS service should a company use to decouple large monolithic applications into smaller microservices components?",
    "a1": "A. AWS Direct Connect",
    "a2": "B. Amazon Lightsail",
    "a3": "C. Amazon Simple Queue Service (Amazon SQS)",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "C"
  },
  {
    "id": 359,
    "q": "A company's system administrator discovers that someone logged in to the company's AWS account during the weekend and terminated an Amazon EC2 instance. Which AWS service should the system administrator use to identify who made this change?",
    "a1": "A. Amazon Inspector",
    "a2": "B. Amazon Pinpoint",
    "a3": "C. AWS CloudTrail",
    "a4": "D. AWS Trusted Advisor",
    "a5": "",
    "as": "C"
  },
  {
    "id": 360,
    "q": "Which AWS service or tool lists all the users in an account and reports on the status of account details, including passwords, access keys, and multi-factor authentication (MFA) devices?",
    "a1": "A. AWS Shield",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. Amazon Inspector",
    "a4": "D. IAM credential report",
    "a5": "",
    "as": "D"
  },
  {
    "id": 361,
    "q": "Which AWS service offers threat detection and continuously monitors for malicious activity and unauthorized behavior in AWS accounts?",
    "a1": "A. Amazon Macie",
    "a2": "B. AWS Config",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "C"
  },
  {
    "id": 362,
    "q": "A company needs to use Amazon S3 to store audio files that are each 5 megabytes in size. The company will rarely access the files, but the company must be able to retrieve the files immediately. Which S3 storage class will meet these requirements MOST cost-effectively?",
    "a1": "A. S3 Standard",
    "a2": "B. S3 Standard-Infrequent Access (S3 Standard-IA)",
    "a3": "C. S3 Glacier Flexible Retrieval",
    "a4": "D. S3 Glacier Deep Archive",
    "a5": "",
    "as": "B"
  },
  {
    "id": 363,
    "q": "A user wants to control AWS services by using the AWS CLI. What are the MINIMUM security credentials that the user needs to achieve this goal?",
    "a1": "A. AWS account user name and password",
    "a2": "B. Multi-factor authentication (MFA)",
    "a3": "C. Access keys",
    "a4": "D. Key pairs",
    "a5": "",
    "as": "C"
  },
  {
    "id": 364,
    "q": "A company has stopped all of its Amazon EC2 instances but monthly billing charges continue to occur. What could be causing this? (Choose two.)",
    "a1": "A. Amazon Elastic Block Store (Amazon EBS) storage charges",
    "a2": "B. Operating system charges",
    "a3": "C. Hardware charges",
    "a4": "D. Elastic IP charges",
    "a5": "E. Input/output (I/O) charges",
    "as": "AD"
  },
  {
    "id": 365,
    "q": "A company has set up its IT infrastructure in the AWS Cloud. The company wants to receive detailed reports that break down AWS costs by the hour. The reports must be placed in an Amazon S3 bucket. Which AWS tool will meet these requirements?",
    "a1": "A. AWS Cost and Usage Reports",
    "a2": "B. AWS Pricing Calculator",
    "a3": "C. Cost Explorer",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "A"
  },
  {
    "id": 366,
    "q": "Which AWS service or feature enables users to block the incoming or outgoing traffic associated with specific IP addresses flowing through a VPC?",
    "a1": "A. Network ACLs",
    "a2": "B. Security groups",
    "a3": "C. AWS Identity and Access Management (IAM)",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "A"
  },
  {
    "id": 367,
    "q": "What is the customer ALWAYS responsible for managing, according to the AWS shared responsibility model?",
    "a1": "A. Software licenses",
    "a2": "B. Networking",
    "a3": "C. Customer data",
    "a4": "D. Encryption keys",
    "a5": "",
    "as": "C"
  },
  {
    "id": 368,
    "q": "Which Reserved Instance (RI) provides the HIGHEST average cost savings compared to an On-Demand Instance?",
    "a1": "A. 1-year, No Upfront, Standard RI",
    "a2": "B. 1-year, All Upfront, Convertible RI",
    "a3": "C. 3-year, All Upfront, Standard RI",
    "a4": "D. 3-year, No Upfront, Convertible RI",
    "a5": "",
    "as": "C"
  },
  {
    "id": 369,
    "q": "Elasticity in the AWS Cloud refers to which of the following? (Choose two.)",
    "a1": "A. How quickly an Amazon EC2 instance can be restarted",
    "a2": "B. The ability to rightsize resources as demand shifts",
    "a3": "C. The maximum amount of RAM an Amazon EC2 instance can use",
    "a4": "D. The pay-as-you-go billing model",
    "a5": "E. How easily resources can be procured when they are needed",
    "as": "BE"
  },
  {
    "id": 370,
    "q": "A company has a set of ecommerce applications. The applications need to be able to send messages to each other. Which AWS service meets this requirement?",
    "a1": "A. AWS Auto Scaling",
    "a2": "B. Elastic Load Balancing",
    "a3": "C. Amazon Simple Queue Service (Amazon SQS)",
    "a4": "D. Amazon Kinesis Data Streams",
    "a5": "",
    "as": "C"
  },
  {
    "id": 371,
    "q": "A company wants to receive alerts when resources that are launched in the company's AWS account reach 80% of their service quotas. Which AWS service should the company use to meet this requirement?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. AWS Config",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "B"
  },
  {
    "id": 372,
    "q": "Which pillar of the AWS Well-Architected Framework is focused on the ability of a workload to perform its intended function correctly and consistently at the expected time?",
    "a1": "A. Performance efficiency",
    "a2": "B. Operational excellence",
    "a3": "C. Reliability",
    "a4": "D. Security",
    "a5": "",
    "as": "C"
  },
  {
    "id": 373,
    "q": "Which AWS tool acts as a firewall to control traffic in and out of subnets within a VPC?",
    "a1": "A. Security group",
    "a2": "B. Route table",
    "a3": "C. VPC endpoint",
    "a4": "D. Network access control list (ACL)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 374,
    "q": "A company is running a standard PostgreSQL database on premises. The company is migrating the database to the AWS Cloud and does not want to change the queries that access the database. The company must maximize the query performance. Which AWS service will meet these requirements?",
    "a1": "A. Amazon RDS for PostgreSQL",
    "a2": "B. Amazon Aurora PostgreSQL",
    "a3": "C. Amazon DocumentDB (with MongoDB compatibility)",
    "a4": "D. Amazon DynamoDB",
    "a5": "",
    "as": "A"
  },
  {
    "id": 375,
    "q": "A company needs to use machine learning and pattern matching to identify and protect sensitive data that the company stores in the AWS Cloud. Which AWS service will meet these requirements?",
    "a1": "A. Amazon Inspector",
    "a2": "B. Amazon Macie",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. AWS Audit Manager",
    "a5": "",
    "as": "B"
  },
  {
    "id": 376,
    "q": "A company wants to offer direct phone and chat channels for customer service. The company needs a pay-as-you-go solution that remote customer service agents can use to create and manage voice and chat contact flows. Which AWS service will meet these requirements?",
    "a1": "A. Amazon EventBridge (Amazon CloudWatch Events)",
    "a2": "B. Amazon Connect",
    "a3": "C. Amazon Cognito",
    "a4": "D. AWS Direct Connect",
    "a5": "",
    "as": "B"
  },
  {
    "id": 377,
    "q": "A company has acquired several other companies. All the companies host their IT infrastructure in the AWS Cloud. Which AWS service should the acquiring company use to centralize the account management?",
    "a1": "A. AWS Systems Manager",
    "a2": "B. AWS Organizations",
    "a3": "C. AWS Security Hub",
    "a4": "D. Amazon Workspaces",
    "a5": "",
    "as": "B"
  },
  {
    "id": 378,
    "q": "A company is using AWS for all its IT infrastructure. The company's developers are allowed to deploy applications on their own. The developers want to deploy their applications without having to provision the infrastructure themselves. Which AWS service should the developers use to meet these requirements?",
    "a1": "A. AWS Cloud Formation",
    "a2": "B. AWS CodeBuild",
    "a3": "C. AWS Elastic Beanstalk",
    "a4": "D. AWS CodeDeploy",
    "a5": "",
    "as": "C"
  },
  {
    "id": 379,
    "q": "A company needs to analyze its AWS Cloud environment to determine whether the company is following security best practices. The company wants recommendations about how to close security gaps. Which AWS service should the company use to obtain these recommendations?",
    "a1": "A. AWS WAF",
    "a2": "B. AWS Systems Manager",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Shield",
    "a5": "",
    "as": "C"
  },
  {
    "id": 380,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 381,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 382,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 383,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 384,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 385,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 386,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 387,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 388,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 389,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 390,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 391,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 392,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 393,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 394,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 395,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 396,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 397,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 398,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  },
  {
    "id": 399,
    "q": "",
    "a1": "",
    "a2": "",
    "a3": "",
    "a4": "",
    "a5": "",
    "as": ""
  }
]
