[
  {
    "id": 0,
    "q": "Which service enables customers to audit API calls in their AWS accounts?",
    "a1": "A. AWS CloudTrail",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. Amazon Inspector",
    "a4": "D. AWS X-Ray",
    "a5": "",
    "as": "A"
  },
  {
    "id": 1,
    "q": "What is a customer responsibility when using AWS Lambda according to the AWS shared responsibility model?",
    "a1": "A. Managing the code within the Lambda function",
    "a2": "B. Confirming that the hardware is working in the data center",
    "a3": "C. Patching the operating system",
    "a4": "D. Shutting down Lambda functions when they are no longer in use",
    "a5": "",
    "as": "A"
  },
  {
    "id": 2,
    "q": "A company has 5 TB of data stored in Amazon S3. The company plans to occasionally run queries on the data for analysis. Which AWS service should the company use to run these queries in the MOST cost-effective manner?",
    "a1": "A. Amazon Redshift",
    "a2": "B. Amazon Athena",
    "a3": "C. Amazon Kinesis",
    "a4": "D. Amazon RDS",
    "a5": "",
    "as": "B"
  },
  {
    "id": 3,
    "q": "Which AWS service can be used at no additional cost?",
    "a1": "A. Amazon SageMaker",
    "a2": "B. AWS Config",
    "a3": "C. AWS Organizations",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "C"
  },
  {
    "id": 4,
    "q": "Which AWS Cloud Adoption Framework (AWS CAF) capability belongs to the people perspective?",
    "a1": "A. Data architecture",
    "a2": "B. Event management",
    "a3": "C. Cloud fluency",
    "a4": "D. Strategic partnership",
    "a5": "",
    "as": "C"
  },
  {
    "id": 5,
    "q": "A company wants to make an upfront commitment for continued use of its production Amazon EC2 instances in exchange for a reduced overall cost. Which pricing options meet these requirements with the LOWEST cost? (Choose two.)",
    "a1": "A. Spot Instances",
    "a2": "B. On-Demand Instances",
    "a3": "C. Reserved Instances",
    "a4": "D. Savings Plans",
    "a5": "E. Dedicated Hosts",
    "as": "CD"
  },
  {
    "id": 6,
    "q": "A company wants to migrate its on-premises relational databases to the AWS Cloud. The company wants to use infrastructure as close to its current geographical location as possible. Which AWS service or resource should the company use to select its Amazon RDS deployment area?",
    "a1": "A. Amazon Connect",
    "a2": "B. AWS Wavelength",
    "a3": "C. AWS Regions",
    "a4": "D. AWS Direct Connect",
    "a5": "",
    "as": "C"
  },
  {
    "id": 7,
    "q": "A company is exploring the use of the AWS Cloud, and needs to create a cost estimate for a project before the infrastructure is provisioned. Which AWS service or feature can be used to estimate costs before deployment?",
    "a1": "A. AWS Free Tier",
    "a2": "B. AWS Pricing Calculator",
    "a3": "C. AWS Billing and Cost Management",
    "a4": "D. AWS Cost and Usage Report",
    "a5": "",
    "as": "B"
  },
  {
    "id": 8,
    "q": "A company is building an application that needs to deliver images and videos globally with minimal latency. Which approach can the company use to accomplish this in a cost effective manner?",
    "a1": "A. Deliver the content through Amazon CloudFront.",
    "a2": "B. Store the content on Amazon S3 and enable S3 cross-region replication.",
    "a3": "C. Implement a VPN across multiple AWS Regions.",
    "a4": "D. Deliver the content through AWS PrivateLink.",
    "a5": "",
    "as": "A"
  },
  {
    "id": 9,
    "q": "Which option is a benefit of the economies of scale based on the advantages of cloud computing?",
    "a1": "A. The ability to trade variable expense for fixed expense",
    "a2": "B. Increased speed and agility",
    "a3": "C. Lower variable costs over fixed costs",
    "a4": "D. Increased operational costs across data centers",
    "a5": "",
    "as": "C"
  },
  {
    "id": 10,
    "q": "Which of the following is a software development framework that a company can use to define cloud resources as code and provision the resources through AWS CloudFormation?",
    "a1": "A. AWS CLI",
    "a2": "B. AWS Developer Center",
    "a3": "C. AWS Cloud Development Kit (AWS CDK)",
    "a4": "D. AWS CodeStar",
    "a5": "",
    "as": "C"
  },
  {
    "id": 11,
    "q": "A company is developing an application that uses multiple AWS services. The application needs to use temporary, limited-privilege credentials for authentication with other AWS APIs. Which AWS service or feature should the company use to meet these authentication requirements?",
    "a1": "A. Amazon API Gateway",
    "a2": "B. IAM users",
    "a3": "C. AWS Security Token Service (AWS STS)",
    "a4": "D. IAM instance profiles",
    "a5": "",
    "as": "C"
  },
  {
    "id": 12,
    "q": "Which AWS service is a cloud security posture management (CSPM) service that aggregates alerts from various AWS services and partner products in a standardized format?",
    "a1": "A. AWS Security Hub",
    "a2": "B. AWS Trusted Advisor",
    "a3": "C. Amazon EventBridge",
    "a4": "D. Amazon GuardDuty",
    "a5": "",
    "as": "A"
  },
  {
    "id": 13,
    "q": "Which AWS service is always provided at no charge?",
    "a1": "A. Amazon S3",
    "a2": "B. AWS Identity and Access Management (IAM)",
    "a3": "C. Elastic Load Balancers",
    "a4": "D. AWS WAF",
    "a5": "",
    "as": "B"
  },
  {
    "id": 14,
    "q": "To reduce costs, a company is planning to migrate a NoSQL database to AWS. Which AWS service is fully managed and can automatically scale throughput capacity to meet database workload demands?",
    "a1": "A. Amazon Redshift",
    "a2": "B. Amazon Aurora",
    "a3": "C. Amazon DynamoDB",
    "a4": "D. Amazon RDS",
    "a5": "",
    "as": "C"
  },
  {
    "id": 15,
    "q": "A company is using Amazon DynamoDB. Which task is the company's responsibility, according to the AWS shared responsibility model?",
    "a1": "A. Patch the operating system.",
    "a2": "B. Provision hosts.",
    "a3": "C. Manage database access permissions.",
    "a4": "D. Secure the operating system.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 16,
    "q": "A company has a test AWS environment. A company is planning on testing an application within AWS. The application testing can be interrupted and does not need to run continuously. Which Amazon EC2 purchasing option will meet these requirements MOST cost-effectively?",
    "a1": "A. On-Demand Instances",
    "a2": "B. Dedicated Instances",
    "a3": "C. Spot Instances",
    "a4": "D. Reserved Instances",
    "a5": "",
    "as": "C"
  },
  {
    "id": 17,
    "q": "Which AWS service gives users the ability to discover and protect sensitive data that is stored in Amazon S3 buckets?",
    "a1": "A. Amazon Macie",
    "a2": "B. Amazon Detective",
    "a3": "C. Amazon GuardDuty",
    "a4": "D. AWS IAM Access Analyzer",
    "a5": "",
    "as": "A"
  },
  {
    "id": 18,
    "q": "Which of the following services can be used to block network traffic to an instance? (Choose two.)",
    "a1": "A. Security groups",
    "a2": "B. Amazon Virtual Private Cloud (Amazon VPC) flow logs",
    "a3": "C. Network ACLs",
    "a4": "D. Amazon CloudWatch",
    "a5": "E. AWS CloudTrail",
    "as": "AC"
  },
  {
    "id": 19,
    "q": "Which AWS service can identify when an Amazon EC2 instance was terminated?",
    "a1": "A. AWS Identity and Access Management (IAM)",
    "a2": "B. AWS CloudTrail",
    "a3": "C. AWS Compute Optimizer",
    "a4": "D. Amazon EventBridge",
    "a5": "",
    "as": "B"
  }
]
