[
  {
    "id": 0,
    "q": "A company is planning to run a global marketing application in the AWS Cloud. The application will feature videos that can be viewed by users. The company must ensure that all users can view these videos with low latency. Which AWS service should the company use to meet this requirement?",
    "a1": "A. AWS Auto Scaling",
    "a2": "B. Amazon Kinesis Video Streams",
    "a3": "C. Elastic Load Balancing",
    "a4": "D. Amazon CloudFront",
    "a5": "",
    "as": "D"
  },
  {
    "id": 1,
    "q": "Which pillar of the AWS Well-Architected Framework refers to the ability of a system to recover from infrastructure or service disruptions and dynamically acquire computing resources to meet demand?",
    "a1": "A. Security",
    "a2": "B. Reliability",
    "a3": "C. Performance efficiency",
    "a4": "D. Cost optimization",
    "a5": "",
    "as": "B"
  },
  {
    "id": 2,
    "q": "Which of the following are benefits of migrating to the AWS Cloud? (Choose two.)",
    "a1": "A. Operational resilience",
    "a2": "B. Discounts for products on Amazon.com",
    "a3": "C. Business agility",
    "a4": "D. Business excellence",
    "a5": "E. Increased staff retention",
    "as": "AC"
  },
  {
    "id": 3,
    "q": "A company is planning to replace its physical on-premises compute servers with AWS serverless compute services. The company wants to be able to take advantage of advanced technologies quickly after the migration. Which pillar of the AWS Well-Architected Framework does this plan represent?",
    "a1": "A. Security",
    "a2": "B. Performance efficiency",
    "a3": "C. Operational excellence",
    "a4": "D. Reliability",
    "a5": "",
    "as": "B"
  },
  {
    "id": 4,
    "q": "A large company has multiple departments. Each department has its own AWS account. Each department has purchased Amazon EC2 Reserved Instances. Some departments do not use all the Reserved Instances that they purchased, and other departments need more Reserved Instances than they purchased. The company needs to manage the AWS accounts for all the departments so that the departments can share the Reserved Instances. Which AWS service or tool should the company use to meet these requirements?",
    "a1": "A. AWS Systems Manager",
    "a2": "B. Cost Explorer",
    "a3": "C. AWS Trusted Advisor",
    "a4": "D. AWS Organizations",
    "a5": "",
    "as": "D"
  },
  {
    "id": 5,
    "q": "Which component of the AWS global infrastructure is made up of one or more discrete data centers that have redundant power, networking, and connectivity?",
    "a1": "A. AWS Region",
    "a2": "B. Availability Zone",
    "a3": "C. Edge location",
    "a4": "D. AWS Outposts",
    "a5": "",
    "as": "B"
  },
  {
    "id": 6,
    "q": "Which duties are the responsibility of a company that is using AWS Lambda? (Choose two.)",
    "a1": "A. Security inside of code ",
    "a2": "B. Selection of CPU resources",
    "a3": "C. Patching of operating system",
    "a4": "D. Writing and updating of code",
    "a5": "E. Security of underlying infrastructure",
    "as": "AD"
  },
  {
    "id": 7,
    "q": "Which AWS services or features provide disaster recovery solutions for Amazon EC2 instances? (Choose two.)",
    "a1": "A. EC2 Reserved Instances",
    "a2": "B. EC2 Amazon Machine Images (AMIs)",
    "a3": "C. Amazon Elastic Block Store (Amazon EBS) snapshots",
    "a4": "D. AWS Shield",
    "a5": "E. Amazon GuardDuty",
    "as": "BC"
  },
  {
    "id": 8,
    "q": "A company is migrating to the AWS Cloud instead of running its infrastructure on premises. Which of the following are advantages of this migration? (Choose two.)",
    "a1": "A. Elimination of the need to perform security auditing",
    "a2": "B. Increased global reach and agility",
    "a3": "C. Ability to deploy globally in minutes",
    "a4": "D. Elimination of the cost of IT staff members",
    "a5": "E. Redundancy by default for all compute services",
    "as": "BC"
  },
  {
    "id": 9,
    "q": "A user is comparing purchase options for an application that runs on Amazon EC2 and Amazon RDS. The application cannot sustain any interruption. The application experiences a predictable amount of usage, including some seasonal spikes that last only a few weeks at a time. It is not possible to modify the application. Which purchase option meets these requirements MOST cost-effectively?",
    "a1": "A. Review the AWS Marketplace and buy Partial Upfront Reserved Instances to cover the predicted and seasonal load.",
    "a2": "B. Buy Reserved Instances for the predicted amount of usage throughout the year. Allow any seasonal usage to run on Spot Instances.",
    "a3": "C. Buy Reserved Instances for the predicted amount of usage throughout the year. Allow any seasonal usage to run at an On-Demand rate.",
    "a4": "D. Buy Reserved Instances to cover all potential usage that results from the seasonal usage.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 10,
    "q": "A company wants to review its monthly costs of using Amazon EC2 and Amazon RDS for the past year. Which AWS service or tool provides this information?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. Cost Explorer",
    "a3": "C. Amazon Forecast",
    "a4": "D. Amazon CloudWatch",
    "a5": "",
    "as": "B"
  },
  {
    "id": 11,
    "q": "A company wants to migrate a critical application to AWS. The application has a short runtime. The application is invoked by changes in data or by shifts in system state. The company needs a compute solution that maximizes operational efficiency and minimizes the cost of running the application. Which AWS solution should the company use to meet these requirements?",
    "a1": "A. Amazon EC2 On-Demand Instances",
    "a2": "B. AWS Lambda",
    "a3": "C. Amazon EC2 Reserved Instances",
    "a4": "D. Amazon EC2 Spot Instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 12,
    "q": "Which AWS service or feature allows users to connect with and deploy AWS services programmatically?",
    "a1": "A. AWS Management Console",
    "a2": "B. AWS Cloud9",
    "a3": "C. AWS CodePipeline",
    "a4": "D. AWS software development kits (SDKs)",
    "a5": "",
    "as": "D"
  },
  {
    "id": 13,
    "q": "A company plans to create a data lake that uses Amazon S3. Which factor will have the MOST effect on cost?",
    "a1": "A. The selection of S3 storage tiers",
    "a2": "B. Charges to transfer existing data into Amazon S3",
    "a3": "C. The addition of S3 bucket policies",
    "a4": "D. S3 ingest fees for each request",
    "a5": "",
    "as": "A"
  },
  {
    "id": 14,
    "q": "A company is launching an ecommerce application that must always be available. The application will run on Amazon EC2 instances continuously for the next 12 months. What is the MOST cost-effective instance purchasing option that meets these requirements?",
    "a1": "A. Spot Instances",
    "a2": "B. Savings Plans",
    "a3": "C. Dedicated Hosts",
    "a4": "D. On-Demand Instances",
    "a5": "",
    "as": "B"
  },
  {
    "id": 15,
    "q": "Which AWS service or feature can a company use to determine which business unit is using specific AWS resources?",
    "a1": "A. Cost allocation tags",
    "a2": "B. Key pairs",
    "a3": "C. Amazon Inspector",
    "a4": "D. AWS Trusted Advisor",
    "a5": "",
    "as": "A"
  },
  {
    "id": 16,
    "q": "A company wants to migrate its workloads to AWS, but it lacks expertise in AWS Cloud computing. Which AWS service or feature will help the company with its migration?",
    "a1": "A. AWS Trusted Advisor",
    "a2": "B. AWS Consulting Partners",
    "a3": "C. AWS Artifacts",
    "a4": "D. AWS Managed Services",
    "a5": "",
    "as": "B"
  },
  {
    "id": 17,
    "q": "Which AWS service or tool should a company use to centrally request and track service limit increases?",
    "a1": "A. AWS Config",
    "a2": "B. Service Quotas",
    "a3": "C. AWS Service Catalog",
    "a4": "D. AWS Budgets",
    "a5": "",
    "as": "B"
  },
  {
    "id": 18,
    "q": "Which documentation does AWS Artifact provide?",
    "a1": "A. Amazon EC2 terms and conditions",
    "a2": "B. AWS ISO certifications",
    "a3": "C. A history of a company's AWS spending",
    "a4": "D. A list of previous-generation Amazon EC2 instance types",
    "a5": "",
    "as": "B"
  },
  {
    "id": 19,
    "q": "Which task requires using AWS account root user credentials?",
    "a1": "A. Viewing billing information",
    "a2": "B. Changing the AWS Support plan",
    "a3": "C. Starting and stopping Amazon EC2 instances",
    "a4": "D. Opening an AWS Support case",
    "a5": "",
    "as": "B"
  },
  {
    "id": 20,
    "q": "A company needs to simultaneously process hundreds of requests from different users. Which combination of AWS services should the company use to build an operationally efficient solution?",
    "a1": "A. Amazon Simple Queue Service (Amazon SQS) and AWS Lambda",
    "a2": "B. AWS Data Pipeline and Amazon EC2",
    "a3": "C. Amazon Kinesis and Amazon Athena",
    "a4": "D. AWS Amplify and AWS AppSync",
    "a5": "",
    "as": "A"
  },
  {
    "id": 21,
    "q": "What is the scope of a VPC within the AWS network?",
    "a1": "A. A VPC can span all Availability Zones globally.",
    "a2": "B. A VPC must span at least two subnets in each AWS Region.",
    "a3": "C. A VPC must span at least two edge locations in each AWS Region.",
    "a4": "D. A VPC can span all Availability Zones within an AWS Region.",
    "a5": "",
    "as": "D"
  },
  {
    "id": 22,
    "q": "Which of the following are components of an AWS Site-to-Site VPN connection? (Choose two.)",
    "a1": "A. AWS Storage Gateway",
    "a2": "B. Virtual private gateway",
    "a3": "C. NAT gateway",
    "a4": "D. Customer gateway",
    "a5": "E. Internet gateway",
    "as": "BD"
  },
  {
    "id": 23,
    "q": "A company needs to establish a connection between two VPCs. The VPCs are located in two different AWS Regions. The company wants to use the existing infrastructure of the VPCs for this connection. Which AWS service or feature can be used to establish this connection?",
    "a1": "A. AWS Client VPN",
    "a2": "B. VPC peering",
    "a3": "C. AWS Direct Connect",
    "a4": "D. VPC endpoints",
    "a5": "",
    "as": "B"
  },
  {
    "id": 24,
    "q": "According to the AWS shared responsibility model, what responsibility does a customer have when using Amazon RDS to host a database?",
    "a1": "A. Manage connections to the database",
    "a2": "B. Install Microsoft SQL Server",
    "a3": "C. Design encryption-at-rest strategies",
    "a4": "D. Apply minor database patches",
    "a5": "",
    "as": "A"
  },
  {
    "id": 25,
    "q": "What are some advantages of using Amazon EC2 instances to host applications in the AWS Cloud instead of on premises? (Choose two.)",
    "a1": "A. EC2 includes operating system patch management.",
    "a2": "B. EC2 integrates with Amazon VPC, AWS CloudTrail, and AWS Identity and Access Management (IAM).",
    "a3": "C. EC2 has a 100% service level agreement (SLA).",
    "a4": "D. EC2 has a flexible, pay-as-you-go pricing model.",
    "a5": "E. EC2 has automatic storage cost optimization.",
    "as": "BD"
  },
  {
    "id": 26,
    "q": "A user needs to determine whether an Amazon EC2 instance's security groups were modified in the last month. How can the user see if a change was made?",
    "a1": "A. Use Amazon EC2 to see if the security group was changed.",
    "a2": "B. Use AWS Identity and Access Management (IAM) to see which user or role changed the security group.",
    "a3": "C. Use AWS CloudTrail to see if the security group was changed.",
    "a4": "D. Use Amazon CloudWatch to see if the security group was changed.",
    "a5": "",
    "as": "C"
  },
  {
    "id": 27,
    "q": "Which AWS service will help protect applications running on AWS from DDoS attacks?",
    "a1": "A. Amazon GuardDuty",
    "a2": "B. AWS WAF",
    "a3": "C. AWS Shield",
    "a4": "D. Amazon Inspector",
    "a5": "",
    "as": "C"
  },
  {
    "id": 28,
    "q": "Which AWS service or feature acts as a firewall for Amazon EC2 instances?",
    "a1": "A. Network ACL",
    "a2": "B. Elastic network interface",
    "a3": "C. Amazon VPC",
    "a4": "D. Security group",
    "a5": "",
    "as": "D"
  },
  {
    "id": 29,
    "q": "How does the AWS Cloud pricing model differ from the traditional on-premises storage pricing model?",
    "a1": "A. AWS resources do not incur costs",
    "a2": "B. There are no infrastructure operating costs",
    "a3": "C. There are no upfront cost commitments",
    "a4": "D. There are no software licensing costs",
    "a5": "",
    "as": "C"
  }
]
